&Вместо("ЗарегистрироватьСообщениеКУдалению")
Процедура Мок_ЗарегистрироватьСообщениеКУдалению(ИдентификаторСообщения, НаправлениеПотока)
  ПараметрыМетода = Мокито.МассивПараметров(ИдентификаторСообщения, НаправлениеПотока);
  ПрерватьВыполнение = Ложь;

  МокитоПерехват.АнализВызова(РегистрыСведений.инт_СообщенияКУдалению, "ЗарегистрироватьСообщениеКУдалению", ПараметрыМетода, ПрерватьВыполнение);

  Если Не ПрерватьВыполнение Тогда
    ПродолжитьВызов(ИдентификаторСообщения, НаправлениеПотока);
  КонецЕсли;
КонецПроцедуры

&Вместо("ЗапросОбработанныхСообщенийБезДатыУдаления")
Функция Мок_ЗапросОбработанныхСообщенийБезДатыУдаления(НаправлениеПотока)
  ПараметрыМетода = Мокито.МассивПараметров(НаправлениеПотока);
  ПрерватьВыполнение = Ложь;

  Результат = МокитоПерехват.АнализВызова(РегистрыСведений.инт_СообщенияКУдалению,
    "ЗапросОбработанныхСообщенийБезДатыУдаления", ПараметрыМетода, ПрерватьВыполнение);

  Если Не ПрерватьВыполнение Тогда
    Возврат ПродолжитьВызов(НаправлениеПотока);
  Иначе
    Возврат Результат;
  КонецЕсли;
КонецФункции
