// BSLLS-off
&Вместо("СкомпилироватьОбработку")
Функция Мок_СкомпилироватьОбработку(Знач ТекстОбработчика, Знач ДополнительныеПеременные = Неопределено,
	Знач ТочкаВходаПостОбработки = Ложь)
	ПараметрыМетода = Мокито.МассивПараметров(ТекстОбработчика, ДополнительныеПеременные, ТочкаВходаПостОбработки);
	ПрерватьВыполнение = Ложь;
	
	Результат = МокитоПерехват.АнализВызова(инт_ГенераторОбработок, "СкомпилироватьОбработку", ПараметрыМетода, ПрерватьВыполнение);
	
	Если Не ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов(ТекстОбработчика, ДополнительныеПеременные, ТочкаВходаПостОбработки);
	Иначе
		Возврат Результат;
	КонецЕсли;
КонецФункции

&Вместо("ПодключитьОбработку")
Функция Мок_ПодключитьОбработку(Знач ДвоичныеДанныеEPF, Знач ИмяРегистрации)
	ПараметрыМетода = Мокито.МассивПараметров(ДвоичныеДанныеEPF, ИмяРегистрации);
	ПрерватьВыполнение = Ложь;
	
	Результат = МокитоПерехват.АнализВызова(
		инт_ГенераторОбработок, "ПодключитьОбработку", ПараметрыМетода, ПрерватьВыполнение);
	
	Если Не ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов(ДвоичныеДанныеEPF, ИмяРегистрации);
	Иначе
		Возврат Результат;
	КонецЕсли;
КонецФункции
