#Область ПрограммныйИнтерфейс

Функция ПоследнийЗапросВыборкиПакета(Схема) Экспорт
	
	Результат = Неопределено;
	
	ПакетЗапросов = Схема.ПакетЗапросов;
	Индекс = ПакетЗапросов.Количество();
	Пока Индекс > 0 Цикл
		
		Индекс = Индекс - 1;
		ЗапросПакета = ПакетЗапросов[Индекс];
		
		Если ТипЗнч(ЗапросПакета) = Тип("ЗапросВыбораСхемыЗапроса") Тогда
			
			Если ЗначениеЗаполнено(ЗапросПакета.ТаблицаДляПомещения)
					И Результат = Неопределено Тогда
			
				Результат = ЗапросПакета;
				
			Иначе
				
				Результат = ЗапросПакета;
				Прервать;
				
			КонецЕсли;
				
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолеТолькоДляВыбора(ОписаниеТипов) Экспорт
	
	Результат = ОписаниеТипов.СодержитТип(Тип("МоментВремени"));
	Возврат Результат;
	
КонецФункции

Функция ПолеСРеквизитами(ОписаниеТипов) Экспорт
	
	Результат = ИТК_ТипыКлиентСервер.КоличествоСсылочных(ОписаниеТипов) > 0;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
