////////////////////////////////////////////////////////////////////////////////
// инт_ВалидаторПакетовПовтИсп
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция - Схемы данных спецификации
//
// Параметры:
//  Спецификация -  Строка, справочникСсылка.инт_Схемы - Или OpenApi Схема, или ссылка на справочник ее содержащий.
// 
// Возвращаемое значение:
//  Соответствие - Схемы данных в виде соответствия.
//
Функция СхемыДанныхСпецификации(Знач Спецификация) Экспорт
    
    Если ТипЗнч(Спецификация) = Тип("СправочникСсылка.инт_Схемы") Тогда
    	Спецификация = Справочники.инт_Схемы.ПолучитьOpenApiСхему(Спецификация);
    КонецЕсли;
	    
    СпецификацияВФорматеOpenAPI = инт_КоннекторHTTP.JsonВОбъект(Спецификация);
	
	КомпонентыСпецификации = СпецификацияВФорматеOpenAPI.Получить("components");
	Если Не ЗначениеЗаполнено(КомпонентыСпецификации) Тогда
		ВызватьИсключение НСтр("ru='В спецификации отсутсвует блок ""components""'");
	КонецЕсли;
	
	СхемыДанныхСпецификации = КомпонентыСпецификации.Получить("schemas");
	
	Если Не ЗначениеЗаполнено(СхемыДанныхСпецификации) Тогда
		ВызватьИсключение НСтр("ru='В спецификации отсутсвует блок ""schemas""'");
	КонецЕсли;
	
	Возврат СхемыДанныхСпецификации;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
