// BSLLS:Typo-off
////////////////////////////////////////////////////////////////////////////////
// ВалидаторПакетовПовтИсп
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Схемы данных спецификации
//
// Параметры:
//  Спецификация -  Строка - OpenApi Схема.
// 
// Возвращаемое значение:
//  Соответствие - Схемы данных в виде соответствия.
//
Функция СхемыДанныхСпецификации(Знач Спецификация) Экспорт
    	    
    СпецификацияВФорматеOpenAPI = инт_КоннекторHTTP.JsonВОбъект(Спецификация);
	
	КомпонентыСпецификации = СпецификацияВФорматеOpenAPI.Получить("components");
	Если Не ЗначениеЗаполнено(КомпонентыСпецификации) Тогда
		ВызватьИсключение НСтр("ru='В спецификации отсутствует блок <components>'");
	КонецЕсли;
	
	СхемыДанныхСпецификации = КомпонентыСпецификации.Получить("schemas");
	
	Если Не ЗначениеЗаполнено(СхемыДанныхСпецификации) Тогда
		ВызватьИсключение НСтр("ru='В спецификации отсутствует блок <schemas>'");
	КонецЕсли;
	
	Возврат СхемыДанныхСпецификации;
	
КонецФункции

// Функция - Схема по строковому пути
//
// Параметры:
//  СтроковыйПуть 	- Строка	 - Путь к получению схемы или части схемы. 
//  Спецификация 	- Строка	 - Спецификация openApi котора будет использоваться для разыменования
// 
// Возвращаемое значение:
//  Соответствие - Найденная схема данных.
//
Функция СхемаПоСтроковомуПути(Знач СтроковыйПуть, Знач Спецификация) Экспорт
	
	СхемаПоСтроковомуПути = Неопределено;
	СтроковыйПутьБезРешетки = СтрЗаменить(СтроковыйПуть, "#", "");
	МассивЧастейПути = СтрРазделить(СтроковыйПутьБезРешетки, "/", Ложь);
	
	СхемаПоСтроковомуПути = инт_КоннекторHTTP.JsonВОбъект(Спецификация);
	Для Каждого ЭлементПути Из МассивЧастейПути Цикл
		СхемаПоСтроковомуПути = СхемаПоСтроковомуПути.Получить(ЭлементПути);
		Если СхемаПоСтроковомуПути = Неопределено Тогда
			ТекстОшибки = СтрШаблон("Ошибка при разборе схемы! Не удается получить схему по пути <%1>",
									СтроковыйПуть);
			ЗаписьЖурналаРегистрации("инт_ВалидаторПакетов",
										УровеньЖурналаРегистрации.Ошибка, , ,
										ТекстОшибки);
										
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	КонецЦикла;
		
	Возврат СхемаПоСтроковомуПути;
	
КонецФункции
#КонецОбласти
