// BSLLS:Typo-off
////////////////////////////////////////////////////////////////////////////////
// инт_ЭндпоинтыКлиентСервер
//  
////////////////////////////////////////////////////////////////////////////////
#Область СлужебныйПрограммныйИнтерфейс
Функция СформироватьЗаголовок(Знач АдресРесурса) Экспорт
Заголовок = "<Задайте параметры подключения>";

Если ЗначениеЗаполнено(АдресРесурса) Тогда
	
	МаксимальнаяДлинаЗаголовка = 50;
	ДлинаЛевойЧасти = 37;
	ДлинаПравойЧасти = 10;
	Если СтрДлина(АдресРесурса) > МаксимальнаяДлинаЗаголовка Тогда
		Заголовок = СтрШаблон("%1...%2",  // BSLLS:NestedFunctionInParameters-off
								Лев(АдресРесурса, ДлинаЛевойЧасти),
								Сред(АдресРесурса,
								СтрДлина(АдресРесурса) - ДлинаПравойЧасти));
	Иначе
		Заголовок = АдресРесурса;
	КонецЕсли;
КонецЕсли;

Возврат Заголовок;
КонецФункции

Функция ИмяГруппыЭндпоинт() Экспорт
	Возврат "ГруппаЭндпоинт";
КонецФункции

Функция ИмяГруппыСтраниц() Экспорт
	Возврат "СтраницыАвторизация";
КонецФункции

Функция ИмяАдресРесурса() Экспорт
	Возврат "АдресРесурса";
КонецФункции

Функция ИмяТипАвторизации() Экспорт
	Возврат "ТипАвторизации";
КонецФункции

#КонецОбласти
