////////////////////////////////////////////////////////////////////////////////
// инт_ЭндпоинтыКлиент
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс
Процедура АдресРесурсаПриИзменении(АдресРесурса, Форма) Экспорт
	Форма.Элементы[инт_ЭндпоинтыКлиентСервер.ИмяГруппыЭндпоинт()].Заголовок = инт_ЭндпоинтыКлиентСервер.СформироватьЗаголовок(АдресРесурса);
КонецПроцедуры

Процедура ТипАвторизацииПриИзменении(ТипАвторизации, Форма) Экспорт
	Если НЕ ЗначениеЗаполнено(ТипАвторизации) Тогда
		Возврат;
	КонецЕсли;
	Форма.Элементы[инт_ЭндпоинтыКлиентСервер.ИмяГруппыСтраниц()].ТекущаяСтраница = Форма.Элементы[Строка(ТипАвторизации)];
КонецПроцедуры

#КонецОбласти
