&Вместо("ЗаписатьСтатистикуОбработкиВходящего")
Процедура Мок_ЗаписатьСтатистикуОбработкиВходящего(ИдентификаторСообщения, ПотокДанных, ДлительностьМс, Успешно = Истина)
  ПараметрыМетода = Мокито.МассивПараметров(ИдентификаторСообщения, ПотокДанных, ДлительностьМс, Успешно);
  ПрерватьВыполнение = Ложь;

  МокитоПерехват.АнализВызова(РегистрыСведений.инт_СтатистикаОбработкиСообщений, "ЗаписатьСтатистикуОбработкиВходящего", ПараметрыМетода, ПрерватьВыполнение);

  Если Не ПрерватьВыполнение Тогда
    ПродолжитьВызов(ИдентификаторСообщения, ПотокДанных, ДлительностьМс, Успешно);
  КонецЕсли;
КонецПроцедуры
