
&НаСервере
Процедура СписокПриАктивизацииСтрокиНаСервере(ИдентификаторСообщения)
	
	СписокОтправка.Параметры.УстановитьЗначениеПараметра("ИдентификаторСообщения", ИдентификаторСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Элементы.ПриВыбореСтрокиВсплывающий.Видимость = Истина;
	
	ИдентификаторСообщения = Элемент.ТекущиеДанные.ИдентификаторСообщения;
	
	СписокПриАктивизацииСтрокиНаСервере(ИдентификаторСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	Элементы.ПриВыбореСтрокиВсплывающий.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьСтатусНаСервере(Статус, УИД, ТекстОшибки)
	
    РегистрыСведений.инт_ТекущийСтатусИсходящихСообщений.ЗаписатьСтатусСообщения(УИД, Статус, ТекстОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатус(Команда)
		
	СтатусГотовоКОтправке 		= ПредопределенноеЗначение("Перечисление.инт_СтатусыИсходящихСообщений.ГотовоКОтправке");
	СтатусНовый 				= ПредопределенноеЗначение("Перечисление.инт_СтатусыИсходящихСообщений.Новый");
	СтатусОтправлено 			= ПредопределенноеЗначение("Перечисление.инт_СтатусыИсходящихСообщений.Отправлено");
	СтатусОшибкаОтправки 		= ПредопределенноеЗначение("Перечисление.инт_СтатусыИсходящихСообщений.ОшибкаОтправки");
	СтатусОшибкаФормирования 	= ПредопределенноеЗначение("Перечисление.инт_СтатусыИсходящихСообщений.ОшибкаФормирования");
	СтатусФормированиеСообщения = ПредопределенноеЗначение("Перечисление.инт_СтатусыИсходящихСообщений.ФормированиеСообщения");
	
	СписокЗначений = Новый СписокЗначений;
	
	СписокЗначений.Добавить(СтатусГотовоКОтправке);
	СписокЗначений.Добавить(СтатусНовый);
	СписокЗначений.Добавить(СтатусОтправлено);
	СписокЗначений.Добавить(СтатусОшибкаОтправки);
	СписокЗначений.Добавить(СтатусОшибкаФормирования);
	СписокЗначений.Добавить(СтатусФормированиеСообщения);
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ИзменитьСтатусЗавершение", ЭтотОбъект), СписокЗначений, Элементы.ПолеСтатусСообщения);
								
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьСтатусНаСервере(ВыбранныйЭлемент.Значение,
							Элементы.Список.ТекущиеДанные.ИдентификаторСообщения,
							Элементы.Список.ТекущиеДанные.ТекстОшибки);
	
	Элементы.Список.Обновить();
	
	СписокПриАктивизацииСтроки(Элементы.Список);
							
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСтатусов(Команда)
		
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ИдентификаторСообщения", Элементы.Список.ТекущиеДанные.ИдентификаторСообщения);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("РегистрСведений.инт_ИсторияСтатусовИсходящихСообщений.ФормаСписка", ПараметрыФормы, ЭтаФорма);
		
КонецПроцедуры
