#Область ПрограммныйИнтерфейс

Функция ПолноеИмяФормыОбработки() Экспорт
	
	Имя = ИТКВ_КонструкторЗапросовПовтИсп.ИмяОбработки();
	
	Если ЗначениеЗаполнено(Имя) Тогда
		
		Возврат СтрШаблон("Обработка.%1.Форма", Имя);
		
	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СписокВыбораИсточникаСвязей(Источники, ИмяИсключения) Экспорт
	
	Результат = Новый СписокЗначений;
	Для Каждого ОписаниеИсточника Из Источники.ПолучитьЭлементы() Цикл
		
		Если ОписаниеИсточника.Name = ИмяИсключения Тогда
			Продолжить;
		КонецЕсли;
		
		Картинка = ИТКВ_КонструкторЗапросов.КартинкаИсточникаСвязи(ОписаниеИсточника.TableName);
		Результат.Добавить(ОписаниеИсточника.Name, ОписаниеИсточника.Presentation, , Картинка);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
