&Вместо("СформироватьСообщениеПоПотоку")
Функция Мок_СформироватьСообщениеПоПотоку(ИсходныеДанные, ПотокДанных)
  ПараметрыМетода = Мокито.МассивПараметров(ИсходныеДанные, ПотокДанных);
  ПрерватьВыполнение = Ложь;

  Результат = МокитоПерехват.АнализВызова(Справочники.инт_ПотокиДанных, "СформироватьСообщениеПоПотоку", ПараметрыМетода, ПрерватьВыполнение);

  Если Не ПрерватьВыполнение Тогда
    Возврат ПродолжитьВызов(ИсходныеДанные, ПотокДанных);
  Иначе
    Возврат Результат;
  КонецЕсли;
КонецФункции
