////////////////////////////////////////////////////////////////////////////////
// инт_ОбработкаВходящихПотоков
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс
// Функция - Размер пачки Отправки сообщений
// 
// Возвращаемое значение:
// Число  -  Количество сообщений обрабатываемое в одним потоком.
//
Функция РазмерПачкиОтправкиСообщений() Экспорт
    Возврат Константы.инт_РазмерПачкиОбработкиВходящихСообщений.Получить();
КонецФункции
    
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
