#Область ПрограммныйИнтерфейс

Процедура ОткрытьРедактированиеВыражения(Элемент, Контекст, СтандартнаяОбработка, Заголовок = Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Параметры = Новый Структура;
	Параметры.Вставить("Заголовок", Заголовок);
	Параметры.Вставить("Контекст", Контекст);
	Параметры.Вставить("Выражение", Элемент.ТекстРедактирования);
	
	ОткрытьФорму("Обработка.ИТКВ_КонструкторСКД.Форма.РедактированиеВыражения", Параметры, Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ОткрытьВыборПоля(Элемент, ДоступныеПоля, СтандартнаяОбработка, ЭтоПолеПредставления = Ложь) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ДоступныеПоля) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Структура;
	Параметры.Вставить("Поле", Элемент.ТекстРедактирования);
	Параметры.Вставить("ДоступныеПоля", ДоступныеПоля);
	Параметры.Вставить("ЭтоПолеПредставления", ЭтоПолеПредставления);
	
	ОткрытьФорму("Обработка.ИТКВ_КонструкторСКД.Форма.ВыборПоля", Параметры, Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ОткрытьВыраженияУпорядочивания(Владелец, КонтекстВыражения, Значение, ОповещениеОЗакрытии, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Параметры = Новый Структура;
	Параметры.Вставить("Значение", Значение);
	Параметры.Вставить("КонтекстВыражения", КонтекстВыражения);
	
	ОткрытьФорму("Обработка.ИТКВ_КонструкторСКД.Форма.ВыраженияУпорядочивания", Параметры, Владелец, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ОткрытьПоляГруппировки(Владелец, Значение, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Параметры = Новый Структура;
	Параметры.Вставить("Значение", Значение);
	
	ОткрытьФорму("Обработка.ИТКВ_КонструкторСКД.Форма.РедактированиеПолейГруппировки", Параметры, Владелец, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Функция ИсточникВыбораКонструкторСКД(Источник) Экспорт
	
	Возврат ТипЗнч(Источник) = Тип("УправляемаяФорма")
				И СтрНайти(Источник.ИмяФормы, "КонструкторСКД");

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
