///////////////////////////////////////////////////////////////////////////////
// инт_ПодписчикиОбщийПовтИсп
// Модуль с повторным использованием возвращаемых значений на время сеанса
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает список имён справочников подписчиков из ОпределяемогоТипа
//
// Возвращаемое значение:
//  Массив из Строка - Имена справочников (инт_ПодписчикHTTP, инт_ПодписчикJRPC и т.д.)
//
Функция СписокТиповПодписчиков() Экспорт
    
    Результат = Новый Массив;
    
    Для Каждого Тип Из Метаданные.ОпределяемыеТипы.инт_Подписчик.Тип.Типы() Цикл
        ПолноеИмя = ПолноеИмяОбъектаМетаданных(Тип);
        Если ПолноеИмя <> Неопределено Тогда
            // "Справочник.инт_ПодписчикHTTP" -> "инт_ПодписчикHTTP"
            Результат.Добавить(СтрРазделить(ПолноеИмя, ".")[1]);
        КонецЕсли;
    КонецЦикла;
    
    Возврат Результат;
    
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолноеИмяОбъектаМетаданных(Тип)
    ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
    Если ОбъектМетаданных = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;
    Возврат ОбъектМетаданных.ПолноеИмя();
КонецФункции

#КонецОбласти
