////////////////////////////////////////////////////////////////////////////////

// инт_СтатусыИсходящихСообщенийПовтИсп

//  

////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция - Это ошибочный статус
//
// Параметры:
//  Статус     -  ПеречислениеСсылка.инт_СтатусыИсходящихСообщений -  Ссылка на проверяемый статус.
// 
// Возвращаемое значение:
//  Булево - Истина, если статус относится к ошибочным и Ложь, если нет. 
//
Функция ЭтоОшибочныйСтатус(СтатусСообщения)
	Возврат Перечисления.инт_СтатусыИсходящихСообщений.ЭтоОшибочныйСтатус(СтатусСообщения)
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
