///////////////////////////////////////////////////////////////////////////////
// инт_ОтправкаИсходящихСообщенийПовтИсп
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс
// Функция - Количество потоков Отправки сообщений
// 
// Возвращаемое значение:
//  Число - количество одновременных потоков доступных в системе.
// (см. Константы.инт_КоличествоПотоковФормированияСообщений) 
//
Функция КоличествоПотоковОтправкиСообщений() Экспорт
    Возврат Константы.инт_КоличествоПотоковОтправкиСообщений.Получить();
КонецФункции

// Функция - Размер пачки Отправки сообщений
// 
// Возвращаемое значение:
// Число  -  Количество сообщений обрабатываемое в одним потоком.
//
Функция РазмерПачкиОтправкиСообщений() Экспорт
    Возврат Константы.инт_РазмерПачкиОтправкиСообщений.Получить();
КонецФункции

// Функция - РазделятьПотокиОтправкиПоТипамПодписчиков 
// Возвращаемое значение:
// Булево  -  Используются ли у нас раздельные пулы потоков.
//
Функция РазделятьПотокиОтправкиПоТипамПодписчиков() Экспорт
    Возврат Константы.инт_РазделятьПотокиОтправкиПоТипамПодписчиков.Получить();
КонецФункции

// Функция - Общий модуль обработки сообщений по типу подписчика
// Получает ОМ для обработки сообщений
// Параметры:
//  ТипПодписчика  - ПеречислениеСсылка.инт_ТипыПодписчиков - ссылка на тип подписчика.
// 
// Возвращаемое значение:
//  ОбщийМодуль - Модуль содержащий процедуры и функции для работы с сообщениями.
//
Функция ОбщийМодульОбработкиСообщенийПоТипуПодписчика(ТипПодписчика) Экспорт
	Возврат	Перечисления.инт_ТипыПодписчиков.ОбщийМодульОбработкиСообщенийПоТипуПодписчика(ТипПодписчика);
КонецФункции

#КонецОбласти
