///////////////////////////////////////////////////////////////////////////////
// инт_ОтправкаИсходящихСообщенийПовтИсп
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс
// Функция - Количество потоков Отправки сообщений
// 
// Возвращаемое значение:
//  Число - количество одновременных потоков доступных в системе.(см. Константы.инт_КоличествоПотоковФормированияСообщений) 
//
Функция КоличествоПотоковОтправкиСообщений() ЭКспорт
    Возврат Константы.инт_КоличествоПотоковОтправкиСообщений.Получить();
КонецФункции

// Функция - Размер пачки Отправки сообщений
// 
// Возвращаемое значение:
// Число  -  Количество сообщений обрабатываемое в одним потоком.
//
Функция РазмерПачкиОтправкиСообщений() Экспорт
    Возврат Константы.инт_РазмерПачкиОтправкиСообщений.Получить();
КонецФункции

// Функция - РазделятьПотокиОтправкиПоТипамПодписчиков 
// Возвращаемое значение:
// Булево  -  Используются ли у нас раздельные пулы потоков.
//
Функция РазделятьПотокиОтправкиПоТипамПодписчиков() Экспорт
    Возврат Константы.инт_РазделятьПотокиОтправкиПоТипамПодписчиков.Получить();
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
