////////////////////////////////////////////////////////////////////////////////
// инт_Подписчики
//  
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ОбновитьВидимостьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
  
&НаКлиенте
Процедура ТипПодписчикаПриИзменении(Элемент)
    ОбновитьВидимостьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВидимостьДоступностьЭлементовФормы()
    Элементы.ГруппаПараметрыПроизвольногоHTTP.Видимость = Объект.ТипПодписчика = ПредопределенноеЗначение("Перечисление.инт_ТипыПодписчиков.ПроизвольныйHTTP");
КонецПроцедуры

#КонецОбласти
