////////////////////////////////////////////////////////////////////////////////

// инт_ИсторияСтатусовИсходящихСообщений

//  

////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Записать статус в историю
//
// Параметры:
//  Подписчик                  -  СправочникСсылка.инт_Подписчики  - Ссылка на подписчика сообщения.
//  ИдентификаторСообщения     -  УникальныйИдентификатор  - Уникальный идентификатор сообщения
//  Статус                     -  ПеречислениеСсылка.инт_СтатусыИсходящихСообщений  -  Статус сообщения.
//  ТекстОшибки                -  Строка    - Текст ошибки при формировании сообщения 
//
Процедура ЗаписатьСтатусВИсторию(ИдентификаторСообщения, Подписчик, СтатусСообщения, ТекстОшибки="") экспорт
    Запись = РегистрыСведений.инт_ИсторияСтатусовРассылкиСообщений.СоздатьМенеджерЗаписи();
    Запись.Период = ТекущаяДатаСеанса();
    Запись.ИдентификаторСообщения = ИдентификаторСообщения;
    Запись.СтатусСообщения = СтатусСообщения;
    Запись.Подписчик = Подписчик;
    Запись.ТекстОшибки = ТекстОшибки;
    Запись.Записать(Истина);
КонецПроцедуры

// Процедура - Очистить историю по идентификатору
// Очищает историю статусов по переданному идентификатору сообщения
// Параметры:
//  ИдентификаторСообщения     -  УникальныйИдентификатор  - Уникальный идентификатор сообщения
//  Подписчик                  -  СправочникСсылка.инт_Подписчики  - Ссылка на подписчика сообщения.
//
Процедура ОчиститьИсториюСообщений(ИдентификаторСообщения, Подписчик = Неопределено) Экспорт
	Набор = РегистрыСведений.инт_ИсторияСтатусовРассылкиСообщений.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
	Если НЕ Подписчик = Неопределено Тогда
		Набор.Отбор.Подписчик.Установить(Подписчик);
	КонецЕсли;
	Набор.Записать();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
