#Область ПрограммныйИнтерфейс

// Возвращает строку ДокументСсылка.<Имя>, СправочникСсылка.<Имя>
//
// Параметры:
//   ИмяОбъектаКоллекции - Строка - Имя объект коллекции
//   ИмяОбъекта - Строка - Имя объекта
//   Язык - Строка - Код языка
//
// Возвращаемое значение:
//   Строка - Строка ссылочного типа метаданных
//
Функция ТипСсылка(ИмяОбъектаКоллекции, ИмяОбъекта = "", Язык = Неопределено) Экспорт
	
	Если Язык = Неопределено Тогда
		Язык = ИТК_ОбщийКлиентСервер.КодТекущегоЯзыка();
	КонецЕсли;
	
	ИдентификаторСсылки = НСтр("ru = 'Ссылка'; en = 'Ref'", Язык);
	Если ЗначениеЗаполнено(ИмяОбъекта) Тогда
		
		Результат = СтрШаблон("%1%2.%3", ИмяОбъектаКоллекции, ИдентификаторСсылки, ИмяОбъекта);
		
	Иначе
		
		Результат = СтрШаблон("%1%2", ИмяОбъектаКоллекции, ИдентификаторСсылки);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоТипКлючЗаписиРегистраСведений(Тип) Экспорт
	
	Возврат СтрНачинаетсяС(Тип, "Регистр сведений ключ записи:");
	
КонецФункции

Функция ОбъектКлючЗаписиРегистра(Объект) Экспорт
	
	Тип = ТипЗнч(Объект);
	Возврат СтрНачинаетсяС(Тип, "Регистр сведений ключ записи:")
				ИЛИ СтрНачинаетсяС(Тип, "Регистр накопления ключ записи:")
				ИЛИ СтрНачинаетсяС(Тип, "Регистр расчета ключ записи:")
				ИЛИ СтрНачинаетсяС(Тип, "Регистр бухгалтерии ключ записи:");
	
КонецФункции

Функция ПредставлениеОбъектаИсточникаПодписки(Событие, ИмяКоллекции, Имя) Экспорт
	
	Дополнение = ИТК_МетаданныеКлиентСерверПовтИсп.ДополнениеКоллекцииИсточникаПодписки(Событие, ИмяКоллекции);
	Возврат СтрШаблон("%1 (%2)", Имя, Дополнение);
	
КонецФункции

#КонецОбласти
