#Область ПрограммныйИнтерфейс

// Получает картинку по типу
//
// Параметры:
//  Тип  - Тип - Тип
//
// Возвращаемое значение:
//   Картинка - Картинка типа
//
Функция Картинка(Тип) Экспорт
	
	Возврат ИТКВ_Типы.Картинка(Тип);
	
КонецФункции

// Получает картинку по описание типов
//
// Параметры:
//  ОписаниеТипов  - ОписаниеТипов - Описание типов
//
// Возвращаемое значение:
//   Картинка - Картинка описания типов
//
Функция КартинкаОписания(ОписаниеТипов) Экспорт
	
	Возврат ИТКВ_Типы.КартинкаОписания(ОписаниеТипов);
	
КонецФункции

Функция ЭтоСсылочный(Тип, ИсключаяПеречисления = Ложь) Экспорт
	
	Возврат ИТКВ_ТипыКлиентСервер.ЭтоСсылочный(Тип, ИсключаяПеречисления);
	
КонецФункции

#КонецОбласти
