// BSLLS:Typo-off
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ВыполнитьПервоначальноеЗаполнение(Команда)
	НаборКонстант.инт_КоличествоПотоковОтправкиСообщений = 10;
	НаборКонстант.инт_КоличествоПотоковФормированияСообщений = 10;
	НаборКонстант.инт_РазделятьПотокиОтправкиПоТипамПодписчиков = Ложь;
	НаборКонстант.инт_РазмерПачкиОбработкиВходящихСообщений = 10000;
	НаборКонстант.инт_РазмерПачкиОтправкиСообщений = 1000;
	НаборКонстант.инт_РазмерПачкиФормированияСообщений = 1000;
КонецПроцедуры

#КонецОбласти
