#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт

    ЮТТесты
	.ДобавитьТест("ПроверитьФормированиеСообщенияПоПодписчику")
	.ДобавитьТест("ПроверитьОтправкуСообщения")
	.ДобавитьТест("ПроверитьПостОбработку");

КонецПроцедуры

#Область События

Процедура ПередВсемиТестами() Экспорт

КонецПроцедуры

Процедура ПередКаждымТестом() Экспорт

КонецПроцедуры

Процедура ПослеКаждогоТеста() Экспорт

КонецПроцедуры

Процедура ПослеВсехТестов() Экспорт

КонецПроцедуры

#КонецОбласти

Процедура ПроверитьФормированиеСообщенияПоПодписчику() Экспорт
	
	ПотокДанных = ГенераторТестовыхДанных.ПотокДанныхИсходящий();
    ИсходныеДанные = ГенераторТестовыхДанных.демо_Документ();
	ДанныеСообщения = Справочники.инт_ПотокиДанных.СформироватьСообщениеПоПотоку(ИсходныеДанные, ПотокДанных);
	Подписчик = ГенераторТестовыхДанных.Подписчик(Перечисления.инт_ТипыПодписчиков.ПодсистемаИнтеграции);
	
	СформированноеСообщение = Справочники.инт_Подписчики.СформироватьСообщениеПоПодписчику(ДанныеСообщения, Подписчик);
	
	ЮТест.ОжидаетЧто(СформированноеСообщение)
	.ИмеетТип(Тип("Строка"))
	.НеРавно("");
	
КонецПроцедуры

Процедура ПроверитьОтправкуСообщения() Экспорт
	
	ПотокДанных = ГенераторТестовыхДанных.ПотокДанныхИсходящий();
    ИсходныеДанные = ГенераторТестовыхДанных.демо_Документ();
	Подписчик = ГенераторТестовыхДанных.Подписчик();
    Сообщение = Новый Структура("ИдентификаторСообщения, Подписчик", Новый УникальныйИдентификатор, Подписчик);
    ОбработчикСобытий = инт_ОтправкаИсходящихСообщенийПовтИсп.
                                                ОбщийМодульОбработкиСообщенийПоТипуПодписчика(Подписчик.ТипПодписчика);
												
	ЮТест.ОжидаетЧто(ОбработчикСобытий)
	.Метод("ОтправитьСообщение")
	.Параметр(Сообщение)
	.НеВыбрасываетИсключение();
	
КонецПроцедуры

Процедура ПроверитьПостОбработку() Экспорт
	
	ИсходныеДанные = ГенераторТестовыхДанных.демо_Документ();
	Подписчик = ГенераторТестовыхДанных.Подписчик();
	ПотокДанных = ГенераторТестовыхДанных.ПотокДанныхИсходящий();
    Сообщение = Новый Структура("ИдентификаторСообщения, Подписчик", Новый УникальныйИдентификатор, Подписчик);
    url = СтрШаблон("%1/hs/api/v1/%2/%3", Подписчик.СсылкаНаСервис, ПотокДанных.Код, Сообщение.ИдентификаторСообщения);
	Ответ = инт_КоннекторHTTP.Post(url,,,инт_КоннекторHTTP.СоздатьСессию());

    ЮТест.ОжидаетЧто(Справочники.инт_Подписчики)
	.Метод("ВыполнитьПостОбработку")
	.Параметр(Подписчик)
	.Параметр(Ответ)
	.Параметр(ИсходныеДанные)
	.НеВыбрасываетИсключение();
	
КонецПроцедуры

#КонецОбласти
