#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущаяЗаписьДляФормы = ПолучитьЗаписьРСПоКлючу(Параметры.КлючЗаписи);
	СформированноеСообщениеДЗнач = ФормированиеСообщенияДеревоЗначений(ТекущаяЗаписьДляФормы);

    ЗаписьРСТекущийСтатус = ПолучитьТекущийСтатусПоКлючу(Параметры.КлючЗаписи);
	
	ЗначениеВРеквизитФормы(ТекущаяЗаписьДляФормы, "Запись");
	ЗначениеВРеквизитФормы(ЗаписьРСТекущийСтатус, "ЗаписьРСТекущийСтатусИсходящих");
	ЗначениеВРеквизитФормы(СформированноеСообщениеДЗнач, "СформированноеСообщение");

	СписокОтправка.Параметры.УстановитьЗначениеПараметра("ИдентификаторСообщения",
														 Параметры.ИдентификаторСообщения);
	
КонецПроцедуры
													
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокОтправка

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьСтатус(Команда)
			
	ОткрытьФорму("Перечисление.инт_СтатусыИсходящихСообщений.ФормаВыбора",,,,,,
				Новый ОписаниеОповещения("ИзменитьСтатусЗавершение", ЭтотОбъект));
									
КонецПроцедуры
			
&НаКлиенте
Процедура ИсторияСтатусов(Команда)
		
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ИдентификаторСообщения", Запись.ИдентификаторСообщения);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("РегистрСведений.инт_ИсторияСтатусовИсходящихСообщений.ФормаСписка", ПараметрыФормы, ЭтаФорма);
		
КонецПроцедуры
			
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущийСтатусПоКлючу(КлючЗаписи)
		
	Запись = РегистрыСведений.инт_ТекущийСтатусИсходящихСообщений.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, КлючЗаписи);
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		Возврат Запись;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗаписьРСПоКлючу(КлючЗаписи)
		
	Запись = РегистрыСведений.инт_ОчередьИсходящихСообщений.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, КлючЗаписи);
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		Возврат Запись;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ИзменитьСтатусНаСервере(Статус, ИдентификаторСообщения, ТекстОшибки)
		
    РегистрыСведений.инт_ТекущийСтатусИсходящихСообщений.ЗаписатьСтатусСообщения(ИдентификаторСообщения, Статус, ТекстОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьСтатусНаСервере(ВыбранныйЭлемент,
							Запись.ИдентификаторСообщения,
							ЗаписьРСТекущийСтатусИсходящих.ТекстОшибки);
										
						КонецПроцедуры
						
&НаСервере
Функция ФормированиеСообщенияДеревоЗначений(ТекущаяЗаписьДляФормы)
	
	СформированноеСообщениеСоотв = ТекущаяЗаписьДляФормы.СформированноеСообщение.Получить();
	
	СформированноеСообщениеДЗнач = Новый ДеревоЗначений;
	СформированноеСообщениеДЗнач.Колонки.Добавить("Ключ");
	СформированноеСообщениеДЗнач.Колонки.Добавить("Значение");
	
	СоответствиеВДерево(СформированноеСообщениеСоотв, СформированноеСообщениеДЗнач);
	
	Возврат СформированноеСообщениеДЗнач;
	
КонецФункции

&НаСервере
Процедура СоответствиеВДерево(Соответствие, СтрокаДерева)
	Если Тип("Соответствие") = ТипЗнч(Соответствие) Тогда
		Для Каждого ЭлСтрук	Из Соответствие Цикл
			СтрокаДерева1		= СтрокаДерева.Строки.Добавить();
			СтрокаДерева1.Ключ	= ЭлСтрук.Ключ;
			Если ТипЗнч(ЭлСтрук.Значение) = Тип("Строка") Тогда
				СтрокаДерева1.Значение	= ЭлСтрук.Значение;
			Иначе
				СоответствиеВДерево(ЭлСтрук.Значение, СтрокаДерева1)
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли Тип("Массив") = ТипЗнч(Соответствие) Тогда
		Для Инд = 0 По Соответствие.ВГраница() Цикл
			СтрокаДерева1		= СтрокаДерева.Строки.Добавить();
			СтрокаДерева1.Ключ	= "ЭлементМассива[" + Инд + "]";
			Если ТипЗнч(Соответствие[Инд]) = Тип("Строка") Тогда
				СтрокаДерева1.Значение	= Соответствие[Инд];
			Иначе
				СоответствиеВДерево(Соответствие[Инд], СтрокаДерева1)
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

