// BSLLS-off
&Вместо("СформироватьСообщение")
Функция Мок_СформироватьСообщение(ДанныеСообщения, Подписчик, ИдентификаторСообщения)
	ПараметрыМетода = Мокито.МассивПараметров(ДанныеСообщения, Подписчик, ИдентификаторСообщения);
	ПрерватьВыполнение = Ложь;
	
	Результат = МокитоПерехват.АнализВызова(инт_ПодписчикиОбщий, "СформироватьСообщение", ПараметрыМетода, ПрерватьВыполнение);
	
	Если Не ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов(ДанныеСообщения, Подписчик, ИдентификаторСообщения);
	Иначе
		Возврат Результат;
	КонецЕсли;
КонецФункции

&Вместо("ОтправитьСообщение")
Процедура Мок_ОтправитьСообщение(Сообщение, ОтложенныеДействия)
	ПараметрыМетода = Мокито.МассивПараметров(Сообщение, ОтложенныеДействия);
	ПрерватьВыполнение = Ложь;
	
	МокитоПерехват.АнализВызова(инт_ПодписчикиОбщий, "ОтправитьСообщение", ПараметрыМетода, ПрерватьВыполнение);
	
	Если Не ПрерватьВыполнение Тогда
		ПродолжитьВызов(Сообщение, ОтложенныеДействия);
	КонецЕсли;
КонецПроцедуры
