#Область ПрограммныйИнтерфейс

// Получает картинку простого типа Число, Строка... и т.д.
//
// Параметры:
//  Тип  - Строка - Тип преобразованный функцией Строка()
//
// Возвращаемое значение:
//   Картинка - Картинка типа
//
Функция КартинкаПростого(Тип) Экспорт
	
	Возврат СоответствиеСтрокаТипКартинка().Получить(Тип);
	
КонецФункции

Функция СоответствиеСтрокаТипКартинка() Экспорт
	
	Результат = Новый Соответствие;
	
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "Неопределено", Новый Картинка);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "Строка", БиблиотекаКартинок.ИТК_ТипСтрока);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "Число", БиблиотекаКартинок.ИТК_ТипЧисло);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "Булево", БиблиотекаКартинок.ИТК_ТипБулево);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "ОписаниеТипов", БиблиотекаКартинок.ИТК_ТипОписаниеТипов);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "Тип", БиблиотекаКартинок.ИТК_ТипТип);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "УникальныйИдентификатор", БиблиотекаКартинок.ИТК_ТипУникальныйИдентификатор);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "ХранилищеЗначения", БиблиотекаКартинок.ИТК_ТипХранилищеЗначения);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "ДвоичныеДанные", БиблиотекаКартинок.ИТК_ТипДвоичныеДанные);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "ФиксированнаяСтруктура", БиблиотекаКартинок.ИТК_ТипФиксированнаяКоллекция);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "ФиксированноеСоответствие", БиблиотекаКартинок.ИТК_ТипФиксированнаяКоллекция);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "ФиксированныйМассив", БиблиотекаКартинок.ИТК_ТипФиксированнаяКоллекция);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "СтандартныйПериод", БиблиотекаКартинок.ИТК_ТипСтандартныйПериод);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "МоментВремени", БиблиотекаКартинок.ИТК_ТипМоментВремени);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "Граница", БиблиотекаКартинок.ИТК_ТипГраница);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "ВидДвиженияНакопления", БиблиотекаКартинок.ИТК_ТипВидДвиженияНакопления);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "ВидДвиженияБухгалтерии", БиблиотекаКартинок.ИТК_ТипВидДвиженияБухгалтерии);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "ВидСчета", БиблиотекаКартинок.ИТК_ТипВидСчета);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "ТаблицаЗначений", БиблиотекаКартинок.ВнешнийИсточникДанныхТаблица);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВставитьВСоответствиеСтрокаТипКартинка(Соответствие, Имя, Картинка)
	
	Соответствие.Вставить(Строка(Тип(Имя)), Картинка);
	
КонецПроцедуры

#КонецОбласти
