////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Валидация Тогда
		ПроверяемыеРеквизиты.Добавить("СхемаДанных");
		ПроверяемыеРеквизиты.Добавить("ИмяСхемыПакета");
	КонецЕсли;
	
	Если НаправлениеПотока = Перечисления.инт_НаправлениеПотокаДанных.Исходящий Тогда
		ПроверяемыеРеквизиты.Добавить("Пример");
		ПроверяемыеРеквизиты.Добавить("ОтслеживаемыеРеквизиты");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если НаправлениеПотока = Перечисления.инт_НаправлениеПотокаДанных.Исходящий Тогда
		ПроверитьОтслеживаемыеРеквизиты(Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьОтслеживаемыеРеквизиты(Отказ)
	Дерево = ЗначениеИзСтрокиВнутр(ОтслеживаемыеРеквизиты);
	
	Если Дерево.Строки.Найти(1, "ОтслеживатьИзменения", Истина) = Неопределено Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка! Не отслеживается изменение ни одного поля!";
		Сообщение.Поле = "ОпределитьОтслеживаемыеРеквизиты"; //имя реквизита
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
