////////////////////////////////////////////////////////////////////////////////
// инт_РедакторОбработчика
//  
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	конс_ПодключаемаяКонсольКлиент.ПодключитьРедактор(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Сохранять = Ложь;
	ТекстОбработчика = Параметры.ТекстОбработчика;
	конс_ПодключаемаяКонсольСервер.ИнициализироватьРедактор(ЭтотОбъект, УникальныйИдентификатор, "РедакторКода");
	ДобавитьПеременные();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РедакторКодаДокументСформирован(Элемент)
	конс_ПодключаемаяКонсольКлиент.ОбработчикДокументСформирован(ЭтаФорма);
	конс_ПодключаемаяКонсольКлиент.ЗагрузитьПользовательскийКонтекст(ЭтаФорма);
	конс_ПодключаемаяКонсольКлиент.УстановитьТекст(ЭтаФорма, ТекстОбработчика);
КонецПроцедуры

&НаКлиенте
Процедура РедакторКодаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	конс_ПодключаемаяКонсольКлиент.ОбработчикПриНажатии(ЭтаФорма, ДанныеСобытия);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	ТекстОбработчика = конс_ПодключаемаяКонсольКлиент.ПолучитьТекст(ЭтаФорма);
	Закрыть(ТекстОбработчика);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьПеременные()
	конс_ПодключаемаяКонсольСервер.ДобавитьПеременную(ЭтотОбъект, "Ответ", ,
		"Ответ полученный от удаленной системы. Подробнее см. инт_КоннекторHTTP.ВызватьМетод");
	конс_ПодключаемаяКонсольСервер.ДобавитьПеременную(ЭтотОбъект, "ИсходныеДанные", ,
		"Ссылка на объект ИБ который указан в исходящем сообщении");
КонецПроцедуры

#КонецОбласти
