
Функция ВходящийПотокPOST(Запрос)
    Ответ = Новый HTTPСервисОтвет(200);
    
   ИдентификаторПотока = Запрос.ПараметрыURL.Получить("flow_id");
    ПотокДанных = Справочники.инт_ПотокиДанных.НайтиПоКоду(ИдентификаторПотока);
    
    ТелоСообщения = Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
    Соответствие = инт_КоннекторHTTP.JsonВОбъект(ТелоСообщения);
    Справочники.инт_ПотокиДанных.ОбработатьВходящееСообщениеПоПотоку(Соответствие, ПотокДанных);
    
    Возврат Ответ;
КонецФункции
