////////////////////////////////////////////////////////////////////////////////

// инт_ОтправкаИсходящихСообщений

//  

////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Процедура - Выполнить обработку сообщений в потоке
//
// Параметры:
//  МассивСообщений     -   Массив   -  Массив сообщений которые необходимо обработать в потоке.
//
Процедура ВыполнитьОбработкуСообщенийВПотоке(МассивСообщений) Экспорт
    Поток = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
    Если Поток = Неопределено Тогда
        
    	ВызватьИсключение "Процедура <ВыполнитьОбработкуСообщенийВПотоке> не предназначена для интерактивного выполнения. Она должна работать только в рамках фонового задания.";
    КонецЕсли;
    ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.МенеджерПотоковОтправкиСообщений", УровеньЖурналаРегистрации.Информация,,,СтрШаблон("Запущена обработка сообщений в потоке с ID <%1>", Поток.УникальныйИдентификатор));

    Для Каждого Сообщение Из МассивСообщений Цикл
        Попытка
            РегистрыСведений.инт_ОчередьОтправкиИсходящихСообщений.СформироватьСообщение(Сообщение);
            РегистрыСведений.инт_ОчередьОтправкиИсходящихСообщений.ОтправитьСообщение(Сообщение);
        Исключение
            СообщениеОбОшибке = СтрШаблон("В потоке с идентификатором <%1> не удалось сформровать сообщение с идентификтором <%2> для подписчика <%3>.
            |
            |Информация об ошибке: %4",
            Поток.УникальныйИдентификатор,
            Сообщение.ИдентификаторСообщения,
            Сообщение.Подписчик,
            ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
            ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.ПотокОтправкиСообщений", УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке);
        КонецПопытки;
        
    КонецЦикла;
    
    РегистрыСведений.инт_МенеджерПотоковФормированияСообщений.ОбработатьЗавершениеРаботыПотока(Поток.УникальныйИдентификатор);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
