////////////////////////////////////////////////////////////////////////////////
// инт_ОтправкаИсходящихСообщений
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс
// Процедура - Выполнить обработку сообщений в потоке
//
// Параметры:
//  МассивСообщений     -   Массив   -  Массив сообщений которые необходимо обработать в потоке.
//
Процедура ВыполнитьОбработкуСообщенийВПотоке(МассивСообщений) Экспорт
    Поток = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
    Если Поток = Неопределено Тогда
        
    	ВызватьИсключение "Процедура <ВыполнитьОбработкуСообщенийВПотоке> не предназначена для интерактивного выполнения. Она должна работать только в рамках фонового задания.";
    КонецЕсли;
    ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.МенеджерПотоковОтправкиСообщений", УровеньЖурналаРегистрации.Информация,,,СтрШаблон("Запущена обработка сообщений в потоке с ID <%1>", Поток.УникальныйИдентификатор));
   	ОтложенныеДействия = СоздатьСоответствиеОтложенныхДействийПриОтправке();
    Для Каждого Сообщение Из МассивСообщений Цикл
        Попытка
            РегистрыСведений.инт_ОчередьОтправкиИсходящихСообщений.СформироватьСообщение(Сообщение);
            РегистрыСведений.инт_ОчередьОтправкиИсходящихСообщений.ОтправитьСообщение(Сообщение, ОтложенныеДействия);
        Исключение
            СообщениеОбОшибке = СтрШаблон("В потоке с идентификатором <%1> не удалось сформровать сообщение с идентификтором <%2> для подписчика <%3>.
            |
            |Информация об ошибке: %4",
            Поток.УникальныйИдентификатор,
            Сообщение.ИдентификаторСообщения,
            Сообщение.Подписчик,
            ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
            ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.ПотокОтправкиСообщений",
                                                     УровеньЖурналаРегистрации.Ошибка, , , СообщениеОбОшибке);
        КонецПопытки;
        
    КонецЦикла;
   	ОбработатьОтложенныеДействияПриОтправке(ОтложенныеДействия);
    РегистрыСведений.инт_МенеджерПотоковФормированияСообщений
                            .ОбработатьЗавершениеРаботыПотока(Поток.УникальныйИдентификатор);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Функция - Создать соответствие отложенных действий при отправке
//                                                                                                                    
// Позволяет в момент отправки сообщения запланировать какие-то действия, которые будут выполнены перед завершением обработки потока.
// Например: Реализация пакетной отправки сообщений. Сообщения аккумулируются в массив отправки, после чего отправляются перед завершением работы потока
// Возвращаемое значение:
// Соответствие - Соответствие содержащее идентификатор обработчика, как ключ и Массив параметров метода как значение. 
//
Функция СоздатьСоответствиеОтложенныхДействийПриОтправке()
	Возврат Новый Соответствие();
КонецФункции

Процедура ОбработатьОтложенныеДействияПриОтправке(ОтложенныеДействия)
	Для Каждого Действие Из ОтложенныеДействия Цикл
		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
