///////////////////////////////////////////////////////////////////////////////
// инт_РаботаССообщениямиПодсистемаИнтеграции
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция - Сформировать сообщение по подписчику
//
// Параметры:
//  ДанныеСообщения        - Соответствие                   - Соответствие содержащее данные для сериализации
//  Подписчик              - СправочникСсылка.инт_Подписчики - Ссылка на подписчика
//  ИдентификаторСообщения - УникальныйИдентификатор        - УИД сообщения
// 
// Возвращаемое значение:
//  Строка - Сериализованное, готовое к отправке подписчику сообщение
//
Функция СформироватьСообщениеПоПодписчику(ДанныеСообщения, Подписчик, ИдентификаторСообщения) Экспорт
    // Пока так. 
    // Надо дописать формирование в протобаф и авро куда-то сюда
	Возврат инт_КоннекторHTTP.ОбъектВJson(ДанныеСообщения);
		
КонецФункции

// Процедура - Отправить сообщение подписчику
//
// Параметры:
//  Сообщение     - Структура - Данные сообщения 
//	ОтложенныеДействия - Соответствие - Соответствие для фиксации отложенных действий см. инт_ОтправкаИсходящихСообщенийСлужебный.СоздатьСоответствиеОтложенныхДействийПриОтправке
//
Процедура ОтправитьСообщение(Сообщение, ОтложенныеДействия) Экспорт
	Подписчик = Сообщение.Подписчик;
	Если Подписчик.ПакетнаяОбработка Тогда
		МассивСообщений = ОтложенныеДействия.Получить(Подписчик);
		Если МассивСообщений = Неопределено Тогда
			МассивСообщений = Новый Массив;
		КонецЕсли;
		СтруктураСообщения = инт_РаботаСКафка.ПолучитьСтруктуруСообщенияДляПакетнойОтправки();
		СтруктураСообщения.message = Сообщение.СформированноеСообщение;
		МассивСообщений.Добавить(СтруктураСообщения);
		
		Возврат;
	Иначе
		ИмяТопика = Подписчик.ИмяТопика;
		Брокеры = Подписчик.СсылкаНаСервис.АдресРесурса;
		//ПараметрыАвторизации = ПолучитьПараметрыАвторизации(Подписчик.Эндпоинт);
		
		инт_РаботаСКафка.ОтправитьСообщение(Сообщение.СформированноеСообщение, Брокеры, ИмяТопика);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
