#Область ПрограммныйИнтерфейс

Функция ИмяОбработки() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Версии = СтрРазделить(СистемнаяИнформация.ВерсияПриложения, ".");
	НомерПлатформы = Формат(Число(Версии[2]), "ЧЦ=2; ЧВН=");
	
	ПрефиксИмени = ИТК_ТуллкитКлиентСервер.Префикс() + "QueryWizard";
	
	Результат = Неопределено;
	Для Каждого Обработка Из Метаданные.Обработки Цикл
		
		ИмяОбработки = Обработка.Имя;
		Если СтрНачинаетсяС(ИмяОбработки, ПрефиксИмени)
				И СтрНайти(ИмяОбработки, НомерПлатформы) Тогда
				
			Результат = ИмяОбработки;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
