////////////////////////////////////////////////////////////////////////////////
// инт_КэшированиеСхемOpenApi
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - необходимо ли выполнить обновление кэша схемы данных
//
// Параметры:
//  Схема     - СправочникСсылка.инт_Схемы - Ссылка на схему данных
// 
// Возвращаемое значение:
//  Булево - Истина, если данные кэша нужно обновить.
//
Функция ТребуетсяОбновление(СсылкаНаСхему) Экспорт
Запрос = Новый запрос;
Запрос.Текст = "ВЫБРАТЬ
               |    инт_КэшированиеСхемOpenApi.СсылкаНаСхему КАК СсылкаНаСхему
               |ИЗ
               |    РегистрСведений.инт_КэшированиеСхемOpenApi КАК инт_КэшированиеСхемOpenApi
               |ГДЕ
               |    инт_КэшированиеСхемOpenApi.СсылкаНаСхему = &СсылкаНаСхему
               |    И инт_КэшированиеСхемOpenApi.ДатаОбновления > &ТекущаяДата";
Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
Запрос.УстановитьПараметр("СсылкаНаСхему", СсылкаНаСхему);

Возврат Запрос.Выполнить().Пустой();
КонецФункции
 
// Процедура - Обновить дату кэша прибавляя день к текущей дате.
//
// Параметры:
//  Схема     - СправочникСсылка.инт_Схемы - Ссылка на схему данных 
//
Процедура ОбновитьДатуКэша(Схема) Экспорт
		Запись = РегистрыСведений.инт_КэшированиеСхемOpenApi.СоздатьМенеджерЗаписи();
        День = 38600;
        Запись.ДатаОбновления = ТекущаяДата()+День;
        Запись.СсылкаНаСхему = Схема;
        Запись.Записать(Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
