#Область ПрограммныйИнтерфейс

Функция ДоступенИнструмент(Инструмент) Экспорт
	
	Если Инструмент = ИТКВ_Перечисления.ИнструментЖурналРегистрации() Тогда
		
		Результат = ИТКВ_БСП.Поддерживается();
		
	ИначеЕсли Инструмент = ИТКВ_Перечисления.ИнструментРедакторОбъекта() Тогда
		
		Результат = ПравоДоступа("Использование", Метаданные.Обработки.ИТКВ_РедакторОбъекта);
		
	ИначеЕсли Инструмент = ИТКВ_Перечисления.ИнструментРедакторКонстант() Тогда
		
		Результат = ПравоДоступа("Использование", Метаданные.Обработки.ИТКВ_РедакторКонстант);
		
	ИначеЕсли Инструмент = ИТКВ_Перечисления.ИнструментРедакторПараметровСеанса() Тогда
		
		Результат = ПравоДоступа("Использование", Метаданные.Обработки.ИТКВ_РедакторПараметровСеанса);
		
	ИначеЕсли Инструмент = ИТКВ_Перечисления.ИнструментПоискСсылокНаОбъект() Тогда
		
		Результат = ПравоДоступа("Использование", Метаданные.Обработки.ИТКВ_ПоискСсылокНаОбъект);
		
	ИначеЕсли Инструмент = ИТКВ_Перечисления.ИнструментПоискИЗаменаСсылок() Тогда
		
		Результат = ПравоДоступа("Использование", Метаданные.Обработки.ИТКВ_ПоискИЗаменаСсылок);
		
	ИначеЕсли Инструмент = ИТКВ_Перечисления.ИнструментПодпискиНаСобытия() Тогда
		
		Результат = ПравоДоступа("Использование", Метаданные.Обработки.ИТКВ_ПодпискиНаСобытия);
		
	ИначеЕсли Инструмент = ИТКВ_Перечисления.ИнструментКонсольРазработчика()
				ИЛИ Инструмент = ИТКВ_Перечисления.ИнструментКонсольЗапросов()
				ИЛИ Инструмент = ИТКВ_Перечисления.ИнструментКонсольСхемКомпоновкиДанных()
				ИЛИ Инструмент = ИТКВ_Перечисления.ИнструментКонсольКода() Тогда
		
		Результат = ПравоДоступа("Использование", Метаданные.Обработки.ИТКВ_КонсольРазработчика);
		
	ИначеЕсли Инструмент = ИТКВ_Перечисления.ИнструментМониторЛицензий() Тогда
		
		Результат = ПравоДоступа("Использование", Метаданные.Отчеты.ИТКВ_МониторЛицензий);
		
	ИначеЕсли Инструмент = ИТКВ_Перечисления.ИнструментПользователи() Тогда
		
		Результат = ПравоДоступа("Использование", Метаданные.Обработки.ИТКВ_Пользователи);
		
	ИначеЕсли Инструмент = ИТКВ_Перечисления.ИнструментРегламентныеИФоновыеЗадания() Тогда
		
		Результат = ПравоДоступа("Использование", Метаданные.Обработки.ИТКВ_РегламентныеИФоновыеЗадания);
		
	Иначе
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбъектОбработкиИнструмента(Инструмент, Объект) Экспорт
	
	Если Объект = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Инструмент = ИТКВ_Перечисления.ИнструментПоискИЗаменаСсылок()
			ИЛИ Инструмент = ИТКВ_Перечисления.ИнструментСравнениеОбъектов()	Тогда
			
		// Необходимо обработать и оставить только ссылочные объекты
		ИсключаяПеречисления = (Инструмент = ИТКВ_Перечисления.ИнструментСравнениеОбъектов());
		Результат = ИзОбъектаТолькоСсылки(Объект, ИсключаяПеречисления);
			
	Иначе
		
		Результат = Объект;
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИзОбъектаТолькоСсылки(Объект, ИсключаяПеречисления = Ложь)
	
	ТипЗначенияОбъекта = ТипЗнч(Объект);
	
	Если ТипЗначенияОбъекта = Тип("СписокЗначений") Тогда
		
		Результат = Новый СписокЗначений;
		Для Каждого ЭлементСписка Из Объект Цикл
			
			Значение = ЭлементСписка.Значение;
			Если НЕ ИТКВ_ТипыКлиентСервер.ЭтоСсылочный(ТипЗнч(Значение)) Тогда
				Продолжить;
			КонецЕсли;
			
			Результат.Добавить(Значение);
			
		КонецЦикла;
		
	Иначе
		
		Если ИТКВ_ТипыКлиентСервер.ЭтоСсылочный(ТипЗначенияОбъекта) Тогда
			Результат = Объект;
		Иначе
			Результат = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
