#Область ПрограммныйИнтерфейс

// Возвращает представление
//
// Возвращаемое значение:
//   Строка	- Представление
//
Функция Представление() Экспорт
	
	Возврат НСтр("ru = 'Конструктор схемы компоновки данных'; en = 'Data composition schema designer'");
	
КонецФункции

Функция КартинкаНабораДанных(Тип) Экспорт
	
	Если Тип = ИТК_Перечисления.СКДНаборДанныхЗапрос() Тогда
		
		Результат = БиблиотекаКартинок.ИТК_СКДНаборДанныхЗапрос;
		
	ИначеЕсли Тип = ИТК_Перечисления.СКДНаборДанныхОбъект() Тогда
		
		Результат = БиблиотекаКартинок.ИТК_СКДНаборДанныхОбъект;
		
	ИначеЕсли Тип = ИТК_Перечисления.СКДНаборДанныхОбъединение() Тогда
		
		Результат = БиблиотекаКартинок.ИТК_СКДНаборДанныхОбъединение;
		
	Иначе
		
		Результат = Новый Картинка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КартинкаПоляНабораДанных(Вид) Экспорт
	
	Если Вид = ИТК_Перечисления.СКДВидыПолейНаборовДанныхПоле() Тогда
		
		Результат = БиблиотекаКартинок.Реквизит;
		
	ИначеЕсли Вид = ИТК_Перечисления.СКДВидыПолейНаборовДанныхНабор() Тогда
		
		Результат = БиблиотекаКартинок.ВложеннаяТаблица;
		
	Иначе
		
		Результат = БиблиотекаКартинок.ИТК_Папка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КартинкаМакета(Тип) Экспорт
	
	Если Тип = ИТК_Перечисления.СКДМакетПоля() Тогда
		
		Результат = БиблиотекаКартинок.ИТК_СКДМакетПоля;
		
	ИначеЕсли Тип = ИТК_Перечисления.СКДМакетГруппировки() Тогда
		
		Результат = БиблиотекаКартинок.ИТК_СКДМакетГруппировки;
		
	ИначеЕсли Тип = ИТК_Перечисления.СКДМакетЗаголовкаГруппировки() Тогда
		
		Результат = БиблиотекаКартинок.ИТК_СКДМакетЗаголовкаГруппировки;
		
	ИначеЕсли Тип = ИТК_Перечисления.СКДМакетРесурсов() Тогда
		
		Результат = БиблиотекаКартинок.ИТК_СКДМакетРесурсов;
		
	Иначе
		
		Результат = Новый Картинка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПрефиксИмениНовогоИсточника() Экспорт
	
	Возврат НСтр("ru = 'ИсточникДанных'; en = 'DataSource'");
	
КонецФункции

Функция ПрефиксИмениНовогоПоляНабораДанных(Вид) Экспорт
	
	Если Вид = ИТК_Перечисления.СКДВидыПолейНаборовДанныхГруппа() Тогда
		
		Результат = НСтр("ru = 'Группа'; en = 'Group'");
		
	ИначеЕсли Вид = ИТК_Перечисления.СКДВидыПолейНаборовДанныхПоле() Тогда
		
		Результат = НСтр("ru = 'Поле'; en = 'Field'");
		
	Иначе
		
		Результат = НСтр("ru = 'Набор'; en = 'Set'");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПрефиксИмениНовогоПараметра() Экспорт
	
	Возврат НСтр("ru = 'Параметр'; en = 'Parameter'");
	
КонецФункции

Функция ПрефиксИмениНовойВложеннойСхемы() Экспорт
	
	Возврат НСтр("ru = 'Отчет'; en = 'Report'");
	
КонецФункции

Функция ПрефиксИмениНовогоВариантаНастроек() Экспорт
	
	Возврат НСтр("ru = 'Вариант'; en = 'Variant'");
	
КонецФункции

#КонецОбласти
