// BSLLS:LatinAndCyrillicSymbolInWord-off
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Справочники.инт_Эндпоинты.ДобавитьИнформациюОбЭндпоинтеНаФорму(ЭтотОбъект,
																	Объект.СсылкаНаСхему,
																	Элементы.ГруппаСсылка,
																	"ОбновитьJsonИзУдаленногоИсточника");
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.СсылкаНаСхему = Справочники.инт_Эндпоинты.СоздатьОбновитьЭндпоинт(ЭтотОбъект,
																						ТекущийОбъект.СсылкаНаСхему);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура АдресРесурсаПриИзменении(Элемент)
	инт_ЭндпоинтыКлиент.АдресРесурсаПриИзменении(ЭтотОбъект["АдресРесурса"], ЭтотОбъект);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТипАвторизацииПриИзменении(Элемент)
	инт_ЭндпоинтыКлиент.ТипАвторизацииПриИзменении(ЭтотОбъект["ТипАвторизации"], ЭтотОбъект);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Basic_ПарольПриИзменении(Элемент)
	Basic_ПарольИзменен = Истина;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Bearer_ТокенПриИзменении(Элемент)
	Bearer_ТокенИзменен = Истина;
	Модифицированность = Истина;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Асинх Процедура ОбновитьJsonИзУдаленногоИсточника(Команда)
	Если Модифицированность Тогда
		Ответ = Ждать ВопросАсинх("Перед получением схемы необходимо записать объект. Записать?",
																		РежимДиалогаВопрос.ДаНет, 60); // BSLLS:MagicNumber-off
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Записать();
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	ОбновитьJsonИзУдаленногоИсточникаНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьJsonИзУдаленногоИсточникаНаСервере()
	Объект.ТекстСхемыJson = Справочники.инт_Схемы.ПолучитьТекстJsonДляВнешнейСхемы(Объект);
КонецПроцедуры

#КонецОбласти
