
&НаКлиенте
Процедура ОбновитьJsonИзУдаленногоИсточника(Команда)
    ОбновитьJsonИзУдаленногоИсточникаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьJsonИзУдаленногоИсточникаНаСервере()
    Объект.ТекстСхемыJson = Справочники.инт_Схемы.ПолучитьТекстJsonДляВнешнейСхемы(Объект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Справочники.инт_Эндпоинты.ДобавитьИнформациюОбЭндпоинтеНаФорму(ЭтотОбъект, Объект.СсылкаНаСхему,Элементы.ГруппаСсылка, "ОбновитьJsonИзУдаленногоИсточника");
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.СсылкаНаСхему = Справочники.инт_Эндпоинты.СоздатьОбновитьЭндпоинт(ЭтотОбъект, ТекущийОбъект.СсылкаНаСхему);
КонецПроцедуры

&НаКлиенте
Процедура АдресРесурсаПриИзменении(Элемент)
	инт_ЭндпоинтыКлиент.АдресРесурсаПриИзменении(ЭтотОбъект["АдресРесурса"], ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ТипАвторизацииПриИзменении(Элемент)
	инт_ЭндпоинтыКлиент.ТипАвторизацииПриИзменении(ЭтотОбъект["ТипАвторизации"], ЭтотОбъект);
КонецПроцедуры

