#Область ПрограммныйИнтерфейс

// Получает картинку простого типа Число, Строка... и т.д.
//
// Параметры:
//  Тип  - Строка - Тип преобразованный функцией Строка()
//
// Возвращаемое значение:
//   Картинка - Картинка типа
//
Функция КартинкаПростого(Тип) Экспорт
	
	Возврат СоответствиеСтрокаТипКартинка().Получить(Тип);
	
КонецФункции

Функция СоответствиеСтрокаТипКартинка() Экспорт
	
	Результат = Новый Соответствие;
	
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "Неопределено", Новый Картинка);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "Строка", БиблиотекаКартинок.ИТКВ_ТипСтрока);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "Число", БиблиотекаКартинок.ИТКВ_ТипЧисло);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "Булево", БиблиотекаКартинок.ИТКВ_ТипБулево);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "ОписаниеТипов", БиблиотекаКартинок.ИТКВ_ТипОписаниеТипов);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "Тип", БиблиотекаКартинок.ИТКВ_ТипТип);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "УникальныйИдентификатор", БиблиотекаКартинок.ИТКВ_ТипУникальныйИдентификатор);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "ХранилищеЗначения", БиблиотекаКартинок.ИТКВ_ТипХранилищеЗначения);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "ДвоичныеДанные", БиблиотекаКартинок.ИТКВ_ТипДвоичныеДанные);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "ФиксированнаяСтруктура", БиблиотекаКартинок.ИТКВ_ТипФиксированнаяКоллекция);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "ФиксированноеСоответствие", БиблиотекаКартинок.ИТКВ_ТипФиксированнаяКоллекция);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "ФиксированныйМассив", БиблиотекаКартинок.ИТКВ_ТипФиксированнаяКоллекция);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "СтандартныйПериод", БиблиотекаКартинок.ИТКВ_ТипСтандартныйПериод);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "МоментВремени", БиблиотекаКартинок.ИТКВ_ТипМоментВремени);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "Граница", БиблиотекаКартинок.ИТКВ_ТипГраница);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "ВидДвиженияНакопления", БиблиотекаКартинок.ИТКВ_ТипВидДвиженияНакопления);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "ВидДвиженияБухгалтерии", БиблиотекаКартинок.ИТКВ_ТипВидДвиженияБухгалтерии);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "ВидСчета", БиблиотекаКартинок.ИТКВ_ТипВидСчета);
	ВставитьВСоответствиеСтрокаТипКартинка(Результат, "ТаблицаЗначений", БиблиотекаКартинок.ВнешнийИсточникДанныхТаблица);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВставитьВСоответствиеСтрокаТипКартинка(Соответствие, Имя, Картинка)
	
	Соответствие.Вставить(Строка(Тип(Имя)), Картинка);
	
КонецПроцедуры

#КонецОбласти
