#Область ПрограммныйИнтерфейс

#Область ВидыПеречислений

Функция СКДНаборыДанных() Экспорт
	
	Возврат ПолноеИмяКоллекции("СКДНаборыДанных");
	
КонецФункции

Функция СКДВидыПолейНаборовДанных() Экспорт
	
	Возврат ПолноеИмяКоллекции("СКДВидыПолейНаборовДанных");
	
КонецФункции

Функция СКДМакеты() Экспорт
	
	Возврат ПолноеИмяКоллекции("СКДМакеты");
	
КонецФункции

Функция СКДТипыОтчетаКонструктораНастроекКомпоновкиДанных()
	
	Возврат ПолноеИмяКоллекции("СКДТипыОтчетаКонструктораНастроекКомпоновкиДанных");
	
КонецФункции

Функция ВидыПериодовПолученияФоновыхЗаданий() Экспорт
	
	Возврат ПолноеИмяКоллекции("ВидыПериодовПолученияФоновыхЗаданий");
	
КонецФункции

Функция АлгоритмыОбработкиТекста() Экспорт
	
	Возврат ПолноеИмяКоллекции("АлгоритмыОбработкиТекста");
	
КонецФункции

Функция ВариантыВыводаРезультатаСКД() Экспорт
	
	Возврат ПолноеИмяКоллекции("ВариантыВыводаРезультатаСКД");
	
КонецФункции

Функция ВариантыСравненияДанных() Экспорт
	
	Возврат ПолноеИмяКоллекции("ВариантыСравненияДанных");
	
КонецФункции

Функция ВидыРезультатаЗапроса() Экспорт
	
	Возврат ПолноеИмяКоллекции("ВидыРезультатаЗапроса");
	
КонецФункции

Функция ВидыГраницы() Экспорт
	
	Возврат ПолноеИмяКоллекции("ВидыГраницы");
	
КонецФункции

Функция ВидыВыводаТаблицы() Экспорт
	
	Возврат ПолноеИмяКоллекции("ВидыВыводаТаблицы");
	
КонецФункции

Функция ДействияСЗаменяемымиСсылками() Экспорт
	
	Возврат ПолноеИмяКоллекции("ДействияСЗаменяемымиСсылками");
	
КонецФункции

Функция Инструменты() Экспорт
	
	Возврат ПолноеИмяКоллекции("Инструменты");
	
КонецФункции

Функция ПолучениеПлана() Экспорт
	
	Возврат ПолноеИмяКоллекции("ПолучениеПлана");
	
КонецФункции

Функция РасшифровкаТаблицЗначений() Экспорт
	
	Возврат ПолноеИмяКоллекции("РасшифровкаТаблицЗначений");
	
КонецФункции

Функция РежимыВыполненияЗапроса() Экспорт
	
	Возврат ПолноеИмяКоллекции("РежимыВыполненияЗапроса");
	
КонецФункции

Функция РежимыВыполненияКода() Экспорт
	
	Возврат ПолноеИмяКоллекции("РежимыВыполненияКода");
	
КонецФункции

Функция РежимыВыполненияСКД() Экспорт
	
	Возврат ПолноеИмяКоллекции("РежимыВыполненияСКД");
	
КонецФункции

Функция РежимыДиалогаУправлениеДаннымиВНастройках() Экспорт
	
	Возврат ПолноеИмяКоллекции("РежимыДиалогаУправлениеДаннымиВНастройках");
	
КонецФункции

Функция ВариантыФормыСпискаЗначений() Экспорт
	
	Возврат ПолноеИмяКоллекции("ВариантыФормыСпискаЗначений");
	
КонецФункции

Функция РежимыРедактированияИдентификатора() Экспорт
	
	Возврат ПолноеИмяКоллекции("РежимыРедактированияИдентификатора");
	
КонецФункции

Функция РежимыРедактированияКолонкиТаблицыЗначений() Экспорт
	
	Возврат ПолноеИмяКоллекции("РежимыРедактированияКолонкиТаблицыЗначений");
	
КонецФункции

Функция РежимыРедактированияТипаЗначения() Экспорт
	
	Возврат ПолноеИмяКоллекции("РежимыРедактированияТипаЗначения");
	
КонецФункции

Функция СложныеПараметрыЗапроса() Экспорт
	
	Возврат ПолноеИмяКоллекции("СложныеПараметрыЗапроса");
	
КонецФункции

Функция СУБД() Экспорт
	
	Возврат ПолноеИмяКоллекции("СУБД");
	
КонецФункции

Функция ТипыТранзакцииОбработкиРезультата() Экспорт
	
	Возврат ПолноеИмяКоллекции("ТипыТранзакцииОбработкиРезультата");
	
КонецФункции

Функция ТипыЗначенияВнешнегоИсточника() Экспорт
	
	Возврат ПолноеИмяКоллекции("ТипыЗначенияВнешнегоИсточника");
	
КонецФункции

Функция ТипыЗначенияПараметровЗапроса() Экспорт
	
	Возврат ПолноеИмяКоллекции("ТипыЗначенияПараметровЗапроса");
	
КонецФункции

Функция ТипыКонструктораЗапроса() Экспорт
	
	Возврат ПолноеИмяКоллекции("ТипыКонструктораЗапроса");
	
КонецФункции

Функция ТипыКонструктораСКД() Экспорт
	
	Возврат ПолноеИмяКоллекции("ТипыКонструктораСКД");
	
КонецФункции

Функция ТипыХраненияДанных() Экспорт
	
	Возврат ПолноеИмяКоллекции("ТипыХраненияДанных");
	
КонецФункции

Функция ЭлементыДанных() Экспорт
	
	Возврат ПолноеИмяКоллекции("ЭлементыДанных");
	
КонецФункции

Функция Редакторы() Экспорт
	
	Возврат ПолноеИмяКоллекции("Редакторы");
	
КонецФункции

Функция ТипыЯзыкаРедактора() Экспорт
	
	Возврат ПолноеИмяКоллекции("ТипыЯзыкаРедактора");
	
КонецФункции

Функция ПредставлениеОбъектов() Экспорт

	Возврат ПолноеИмяКоллекции("ПредставлениеОбъектов");
	
КонецФункции

#КонецОбласти

#Область ЗначенияПеречислений

Функция АлгоритмОбработкиТекстаЗакомментировать() Экспорт
	
	Возврат ПолноеИмя(АлгоритмыОбработкиТекста(), "Закомментировать");
	
КонецФункции

Функция АлгоритмОбработкиТекстаУбратьКомментарии() Экспорт
	
	Возврат ПолноеИмя(АлгоритмыОбработкиТекста(), "УбратьКомментарии");
	
КонецФункции

Функция АлгоритмОбработкиТекстаДобавитьПереносыСтрок() Экспорт
	
	Возврат ПолноеИмя(АлгоритмыОбработкиТекста(), "ДобавитьПереносыСтрок");
	
КонецФункции

Функция АлгоритмОбработкиТекстаУбратьПереносыСтрок() Экспорт
	
	Возврат ПолноеИмя(АлгоритмыОбработкиТекста(), "УбратьПереносыСтрок");
	
КонецФункции

Функция АлгоритмОбработкиТекстаПереносЗапросаИзКонфигуратора() Экспорт
	
	Возврат ПолноеИмя(АлгоритмыОбработкиТекста(), "ПереносЗапросаИзКонфигуратора");
	
КонецФункции

Функция СКДНаборДанныхЗапрос() Экспорт
	
	Возврат ПолноеИмя(СКДНаборыДанных(), "Запрос");
	
КонецФункции

Функция СКДНаборДанныхОбъект() Экспорт
	
	Возврат ПолноеИмя(СКДНаборыДанных(), "Объект");
	
КонецФункции

Функция СКДНаборДанныхОбъединение() Экспорт
	
	Возврат ПолноеИмя(СКДНаборыДанных(), "Объединение");
	
КонецФункции

Функция СКДВидыПолейНаборовДанныхПоле() Экспорт
	
	Возврат ПолноеИмя(СКДВидыПолейНаборовДанных(), "Поле");
	
КонецФункции

Функция СКДВидыПолейНаборовДанныхГруппа() Экспорт
	
	Возврат ПолноеИмя(СКДВидыПолейНаборовДанных(), "Группа");
	
КонецФункции

Функция СКДВидыПолейНаборовДанныхНабор() Экспорт
	
	Возврат ПолноеИмя(СКДВидыПолейНаборовДанных(), "Набор");
	
КонецФункции

Функция СКДМакетПоля() Экспорт
	
	Возврат ПолноеИмя(СКДНаборыДанных(), "Поля");
	
КонецФункции

Функция СКДМакетГруппировки() Экспорт
	
	Возврат ПолноеИмя(СКДНаборыДанных(), "Группировки");
	
КонецФункции

Функция СКДМакетЗаголовкаГруппировки() Экспорт
	
	Возврат ПолноеИмя(СКДНаборыДанных(), "ЗаголовкаГруппировки");
	
КонецФункции

Функция СКДМакетРесурсов() Экспорт
	
	Возврат ПолноеИмя(СКДНаборыДанных(), "Ресурсов");
	
КонецФункции

Функция СКДТипОтчетаКонструктораНастроекКомпоновкиДанныхСписок() Экспорт
	
	Возврат ПолноеИмя(СКДТипыОтчетаКонструктораНастроекКомпоновкиДанных(), "Список");
	
КонецФункции

Функция СКДТипОтчетаКонструктораНастроекКомпоновкиДанныхТаблица() Экспорт
	
	Возврат ПолноеИмя(СКДТипыОтчетаКонструктораНастроекКомпоновкиДанных(), "Таблица");
	
КонецФункции

Функция СКДТипОтчетаКонструктораНастроекКомпоновкиДанныхДиаграмма() Экспорт
	
	Возврат ПолноеИмя(СКДТипыОтчетаКонструктораНастроекКомпоновкиДанных(), "Диаграмма");
	
КонецФункции

Функция ВидПериодаПолученияФоновыхЗаданийВсеВремя() Экспорт
	
	Возврат ПолноеИмя(ВидыПериодовПолученияФоновыхЗаданий(), "ВсеВремя");
	
КонецФункции

Функция ВидПериодаПолученияФоновыхЗаданийСегодня() Экспорт
	
	Возврат ПолноеИмя(ВидыПериодовПолученияФоновыхЗаданий(), "Сегодня");
	
КонецФункции

Функция ВидПериодаПолученияФоновыхЗаданийПрошлаяНочь() Экспорт
	
	Возврат ПолноеИмя(ВидыПериодовПолученияФоновыхЗаданий(), "ПрошлаяНочь");
	
КонецФункции

Функция ВидПериодаПолученияФоновыхЗаданийВчера() Экспорт
	
	Возврат ПолноеИмя(ВидыПериодовПолученияФоновыхЗаданий(), "Вчера");
	
КонецФункции

Функция ВидПериодаПолученияФоновыхЗаданийПроизвольный() Экспорт
	
	Возврат ПолноеИмя(ВидыПериодовПолученияФоновыхЗаданий(), "Произвольный");
	
КонецФункции

Функция ВариантВыводаРезультатаСКДТабличныйДокумент() Экспорт
	
	Возврат ПолноеИмя(ВариантыВыводаРезультатаСКД(), "ТабличныйДокумент");
	
КонецФункции

Функция ВариантВыводаРезультатаСКДКоллекция() Экспорт
	
	Возврат ПолноеИмя(ВариантыВыводаРезультатаСКД(), "Коллекция");
	
КонецФункции

Функция ВариантСравненияДанныхТексты() Экспорт
	
	Возврат ПолноеИмя(ВариантыСравненияДанных(), "Тексты");
	
КонецФункции

Функция ВариантСравненияДанныхРезультаты() Экспорт
	
	Возврат ПолноеИмя(ВариантыСравненияДанных(), "Результаты");
	
КонецФункции

Функция ВидРезультатаЗапросаЗапрос() Экспорт
	
	Возврат ПолноеИмя(ВидыРезультатаЗапроса(), "Запрос");
	
КонецФункции

Функция ВидРезультатаЗапросаПакет() Экспорт
	
	Возврат ПолноеИмя(ВидыРезультатаЗапроса(), "Пакет");
	
КонецФункции

Функция ВидГраницыВключая() Экспорт
	
	Возврат ПолноеИмя(ВидыГраницы(), "Включая");
	
КонецФункции

Функция ВидГраницыИсключая() Экспорт
	
	Возврат ПолноеИмя(ВидыГраницы(), "Исключая");
	
КонецФункции

Функция ВидВыводаТаблицыВыводить() Экспорт
	
	Возврат НСтр("ru = 'Выводить'; en = 'Output'");
	
КонецФункции

Функция ВидВыводаТаблицыНеВыводить() Экспорт
	
	Возврат НСтр("ru = 'Не выводить'; en = 'Do not output'");
	
КонецФункции

Функция ВидВыводаТаблицыСвернуто() Экспорт
	
	Возврат НСтр("ru = 'Свернуто'; en = 'Minimized'");
	
КонецФункции

Функция ДействиеСЗаменяемойСсылкойНеУдалять() Экспорт
	
	Возврат ПолноеИмя(ДействияСЗаменяемымиСсылками(), "НеУдалять");
	
КонецФункции

Функция ДействиеСЗаменяемойСсылкойПометитьНаУдаление() Экспорт
	
	Возврат ПолноеИмя(ДействияСЗаменяемымиСсылками(), "ПометитьНаУдаление");
	
КонецФункции

Функция ДействиеСЗаменяемойСсылкойУдалить() Экспорт
	
	Возврат ПолноеИмя(ДействияСЗаменяемымиСсылками(), "Удалить");
	
КонецФункции

Функция ИнструментКонсольРазработчика() Экспорт
	
	Возврат ПолноеИмя(Инструменты(), "КонсольРазработчика");
	
КонецФункции

Функция ИнструментКонсольЗапросов() Экспорт
	
	Возврат ПолноеИмя(Инструменты(), "КонсольЗапросов");
	
КонецФункции

Функция ИнструментКонсольСхемКомпоновкиДанных() Экспорт
	
	Возврат ПолноеИмя(Инструменты(), "КонсольСхемКомпоновкиДанных");
	
КонецФункции

Функция ИнструментКонсольКода() Экспорт
	
	Возврат ПолноеИмя(Инструменты(), "КонсольКода");
	
КонецФункции

Функция ИнструментРедакторОбъекта() Экспорт
	
	Возврат ПолноеИмя(Инструменты(), "РедакторОбъекта");
	
КонецФункции

Функция ИнструментРедакторКонстант() Экспорт
	
	Возврат ПолноеИмя(Инструменты(), "РедакторКонстант");
	
КонецФункции

Функция ИнструментРедакторПараметровСеанса() Экспорт
	
	Возврат ПолноеИмя(Инструменты(), "РедакторПараметровСеанса");
	
КонецФункции

Функция ИнструментПоискСсылокНаОбъект() Экспорт
	
	Возврат ПолноеИмя(Инструменты(), "ПоискСсылокНаОбъект");
	
КонецФункции

Функция ИнструментПоискИЗаменаСсылок() Экспорт
	
	Возврат ПолноеИмя(Инструменты(), "ПоискИЗаменаСсылок");
	
КонецФункции

Функция ИнструментПодпискиНаСобытия() Экспорт
	
	Возврат ПолноеИмя(Инструменты(), "ПодпискиНаСобытия");
	
КонецФункции

Функция ИнструментСравнениеОбъектов() Экспорт
	
	Возврат ПолноеИмя(Инструменты(), "СравнениеОбъектов");
	
КонецФункции

Функция ИнструментПользователи() Экспорт
	
	Возврат ПолноеИмя(Инструменты(), "Пользователи");
	
КонецФункции

Функция ИнструментРегламентныеИФоновыеЗадания() Экспорт
	
	Возврат ПолноеИмя(Инструменты(), "РегламентныеИФоновыеЗадания");
	
КонецФункции

Функция ИнструментМониторЛицензий() Экспорт
	
	Возврат ПолноеИмя(Инструменты(), "МониторЛицензий");
	
КонецФункции

Функция ИнструментЖурналРегистрации() Экспорт
	
	Возврат ПолноеИмя(Инструменты(), "ЖурналРегистрации");
	
КонецФункции

Функция ИнструментОткрытьОбъект() Экспорт
	
	Возврат ПолноеИмя(Инструменты(), "ОткрытьОбъект");
	
КонецФункции

Функция ИнструментАнализПравДоступа() Экспорт
	
	Возврат ПолноеИмя(Инструменты(), "АнализПравДоступа");
	
КонецФункции

Функция ПолучениеПланаОтключено() Экспорт
	
	Возврат ПолноеИмя(ПолучениеПлана(), "Отключено");
	
КонецФункции

Функция ПолучениеПланаТехнологическийЖурнал() Экспорт
	
	Возврат ПолноеИмя(ПолучениеПлана(), "ТехнологическийЖурнал");
	
КонецФункции

Функция РасшифровкаТаблицЗначенийОтключена() Экспорт
	
	Возврат ПолноеИмя(РасшифровкаТаблицЗначений(), "Отключена");
	
КонецФункции

Функция РасшифровкаТаблицЗначенийУпрощенная() Экспорт
	
	Возврат ПолноеИмя(РасшифровкаТаблицЗначений(), "Упрощенная");
	
КонецФункции

Функция РасшифровкаТаблицЗначенийПолная() Экспорт
	
	Возврат ПолноеИмя(РасшифровкаТаблицЗначений(), "Полная");
	
КонецФункции

Функция РежимВыполненияЗапросаВыполнение() Экспорт
	
	Возврат ПолноеИмя(РежимыВыполненияЗапроса(), "Выполнение");
	
КонецФункции

Функция РежимВыполненияЗапросаЗамер() Экспорт
	
	Возврат ПолноеИмя(РежимыВыполненияЗапроса(), "Замер");
	
КонецФункции

Функция РежимВыполненияЗапросаСРезультатамиВременныхТаблиц() Экспорт
	
	Возврат ПолноеИмя(РежимыВыполненияЗапроса(), "СРезультатамиВременныхТаблиц");
	
КонецФункции

Функция РежимВыполненияКодаВыполнение() Экспорт
	
	Возврат ПолноеИмя(РежимыВыполненияКода(), "Выполнение");
	
КонецФункции

Функция РежимВыполненияКодаЗамер() Экспорт
	
	Возврат ПолноеИмя(РежимыВыполненияКода(), "Замер");
	
КонецФункции

Функция РежимВыполненияКодаНаКлиенте() Экспорт
	
	Возврат ПолноеИмя(РежимыВыполненияКода(), "НаКлиенте");
	
КонецФункции

Функция РежимВыполненияСКДВыполнение() Экспорт
	
	Возврат ПолноеИмя(РежимыВыполненияСКД(), "Выполнение");
	
КонецФункции

Функция РежимВыполненияСКДЗамер() Экспорт
	
	Возврат ПолноеИмя(РежимыВыполненияСКД(), "Замер");
	
КонецФункции

Функция РежимВыполненияСКДПолучениеИсполняемыхЗапросов() Экспорт
	
	Возврат ПолноеИмя(РежимыВыполненияСКД(), "ПолучениеИсполняемыхЗапросов");
	
КонецФункции

Функция РежимДиалогаУправлениеДаннымиВНастройкахЗагрузка() Экспорт
	
	Возврат ПолноеИмя(РежимыДиалогаУправлениеДаннымиВНастройках(), "Загрузка");
	
КонецФункции

Функция РежимДиалогаУправлениеДаннымиВНастройкахВыбор() Экспорт
	
	Возврат ПолноеИмя(РежимыДиалогаУправлениеДаннымиВНастройках(), "Выбор");
	
КонецФункции

Функция РежимДиалогаУправлениеДаннымиВНастройкахСохранение() Экспорт
	
	Возврат ПолноеИмя(РежимыДиалогаУправлениеДаннымиВНастройках(), "Сохранение");
	
КонецФункции

Функция РежимРедактированияИдентификатораИдентификатор() Экспорт
	
	Возврат ПолноеИмя(РежимыРедактированияИдентификатора(), "Идентификатор");
	
КонецФункции

Функция РежимРедактированияИдентификатораИдентификаторВременнойТаблицы() Экспорт
	
	Возврат ПолноеИмя(РежимыРедактированияИдентификатора(), "ИдентификаторВременнойТаблицы");
	
КонецФункции

Функция ВариантФормыСписокЗначенийРедактирование() Экспорт
	
	Возврат ПолноеИмя(ВариантыФормыСпискаЗначений(), "ВариантФормыСписокЗначенийРедактирование");
	
КонецФункции

Функция ВариантФормыСписокЗначенийРедактированиеСПреставлением() Экспорт
	
	Возврат ПолноеИмя(ВариантыФормыСпискаЗначений(), "ВариантФормыСписокЗначенийРедактированиеСПреставлением");
	
КонецФункции

Функция ВариантФормыСписокЗначенийВыборНесколькихЗначений() Экспорт
	
	Возврат ПолноеИмя(ВариантыФормыСпискаЗначений(), "ВариантФормыСписокЗначенийВыборНесколькихЗначений");
	
КонецФункции

Функция РежимРедактированияИдентификатораСтрока() Экспорт
	
	Возврат ПолноеИмя(РежимыРедактированияИдентификатора(), "Строка");
	
КонецФункции

Функция РежимРедактированияКолонкиТаблицыЗначенийДобавление() Экспорт
	
	Возврат ПолноеИмя(РежимыРедактированияКолонкиТаблицыЗначений(), "Добавление");
	
КонецФункции

Функция РежимРедактированияКолонкиТаблицыЗначенийИзменение() Экспорт
	
	Возврат ПолноеИмя(РежимыРедактированияКолонкиТаблицыЗначений(), "Изменение");
	
КонецФункции

Функция РежимРедактированияТипаЗначенияВыборТипа() Экспорт
	
	Возврат ПолноеИмя(РежимыРедактированияТипаЗначения(), "ВыборТипа");
	
КонецФункции

Функция РежимРедактированияТипаЗначенияОтборМетаданных() Экспорт
	
	Возврат ПолноеИмя(РежимыРедактированияТипаЗначения(), "ОтборМетаданных");
	
КонецФункции

Функция РежимРедактированияТипаЗначенияРедактированиеОписанияТипов() Экспорт
	
	Возврат ПолноеИмя(РежимыРедактированияТипаЗначения(), "РедактированиеОписанияТипов");
	
КонецФункции

Функция РежимРедактированияТипаЗначенияРедактированиеТипа() Экспорт
	
	Возврат ПолноеИмя(РежимыРедактированияТипаЗначения(), "РедактированиеТипа");
	
КонецФункции

Функция СложныйПараметрЗапросаГраница() Экспорт
	
	Возврат ПолноеИмя(СложныеПараметрыЗапроса(), "Граница");
	
КонецФункции

Функция СложныйПараметрЗапросаТаблицаЗначений() Экспорт
	
	Возврат ПолноеИмя(СложныеПараметрыЗапроса(), "ТаблицаЗначений");
	
КонецФункции

Функция СложныйПараметрЗапросаВыражение() Экспорт
	
	Возврат ПолноеИмя(СложныеПараметрыЗапроса(), "Выражение");
	
КонецФункции

Функция СУБДФайловая() Экспорт
	
	Возврат ПолноеИмя(СУБД(), "Файловая");
	
КонецФункции

Функция СУБДMicrosoftSQL() Экспорт
	
	Возврат ПолноеИмя(СУБД(), "MicrosoftSQL");
	
КонецФункции

Функция СУБДPostgreSQL() Экспорт
	
	Возврат ПолноеИмя(СУБД(), "PostgreSQL");
	
КонецФункции

Функция ТипТранзакцииОбработкиРезультатаНеИспользовать() Экспорт
	
	Возврат ПолноеИмя(ТипыТранзакцииОбработкиРезультата(), "НеИспользовать");
	
КонецФункции

Функция ТипТранзакцииОбработкиРезультатаПоСтроке() Экспорт
	
	Возврат ПолноеИмя(ТипыТранзакцииОбработкиРезультата(), "ПоСтроке");
	
КонецФункции

Функция ТипТранзакцииОбработкиРезультатаНаВсе() Экспорт
	
	Возврат ПолноеИмя(ТипыТранзакцииОбработкиРезультата(), "НаВсе");
	
КонецФункции

Функция ТипЗначенияВнешнегоИсточникаЗначение() Экспорт
	
	Возврат НСтр("ru = 'Значение'; en = 'Value'");
	
КонецФункции

Функция ТипЗначенияВнешнегоИсточникаВыражение() Экспорт
	
	Возврат НСтр("ru = 'Выражение'; en = 'Expression'");
	
КонецФункции

Функция ТипЗначенияПараметраЗапросаЗначение() Экспорт
	
	Возврат НСтр("ru = 'Значение'; en = 'Value'");
	
КонецФункции

Функция ТипЗначенияПараметраЗапросаСписок() Экспорт
	
	Возврат НСтр("ru = 'Список'; en = 'List'");
	
КонецФункции

Функция ТипЗначенияПараметраЗапросаВыражение() Экспорт
	
	Возврат НСтр("ru = 'Выражение'; en = 'Expression'");
	
КонецФункции

Функция ТипКонструктораЗапросаТолстый() Экспорт
	
	Возврат ПолноеИмя(ТипыКонструктораЗапроса(), "Толстый");
	
КонецФункции

Функция ТипКонструктораЗапросаТонкий() Экспорт
	
	Возврат ПолноеИмя(ТипыКонструктораЗапроса(), "Тонкий");
	
КонецФункции

Функция ТипКонструктораЗапросаУлучшенныйТонкий() Экспорт
	
	Возврат ПолноеИмя(ТипыКонструктораЗапроса(), "УлучшенныйТонкий");
	
КонецФункции

Функция ТипКонструктораСКДТолстый() Экспорт
	
	Возврат ПолноеИмя(ТипыКонструктораСКД(), "Толстый");
	
КонецФункции

Функция ТипКонструктораСКДТонкий() Экспорт
	
	Возврат ПолноеИмя(ТипыКонструктораСКД(), "Тонкий");
	
КонецФункции

Функция ТипХраненияДанныхФайл() Экспорт
	
	Возврат ПолноеИмя(ТипыХраненияДанных(), "Файл");
	
КонецФункции

Функция ТипХраненияДанныхНастройка() Экспорт
	
	Возврат ПолноеИмя(ТипыХраненияДанных(), "Настройка");
	
КонецФункции

Функция ЭлементДанныхГруппа() Экспорт
	
	Возврат ПолноеИмя(ЭлементыДанных(), "Группа");
	
КонецФункции

Функция ЭлементДанныхЗапрос() Экспорт
	
	Возврат ПолноеИмя(ЭлементыДанных(), "Запрос");
	
КонецФункции

Функция ЭлементДанныхПодзапрос() Экспорт
	
	Возврат ПолноеИмя(ЭлементыДанных(), "Подзапрос");
	
КонецФункции

Функция ЭлементДанныхКод() Экспорт
	
	Возврат ПолноеИмя(ЭлементыДанных(), "Код");
	
КонецФункции

Функция ЭлементДанныхСхемаКомпоновкиДанных() Экспорт
	
	Возврат ПолноеИмя(ЭлементыДанных(), "СхемаКомпоновкиДанных");
	
КонецФункции

Функция ЭлементДанныхВариантОтчетаСКД() Экспорт
	
	Возврат ПолноеИмя(ЭлементыДанных(), "ВариантОтчетаСКД");
	
КонецФункции

Функция ЭлементДанныхПользовательскаяНастройкаСКД() Экспорт
	
	Возврат ПолноеИмя(ЭлементыДанных(), "ПользовательскаяНастройкаСКД");
	
КонецФункции

Функция РедакторОбычный() Экспорт
	
	Возврат ПолноеИмя(Редакторы(), "Обычный");
	
КонецФункции

Функция РедакторMonaco() Экспорт
	
	Возврат ПолноеИмя(Редакторы(), "Monaco");
	
КонецФункции

Функция ТипЯзыкаРедактораВстроенный() Экспорт
	
	Возврат ПолноеИмя(ТипыЯзыкаРедактора(), "Встроенный");
	
КонецФункции

Функция ТипЯзыкаРедактораЗапросы() Экспорт
	
	Возврат ПолноеИмя(ТипыЯзыкаРедактора(), "Запросы");
	
КонецФункции

Функция ТипЯзыкаРедактораВыраженияСКД() Экспорт
	
	Возврат ПолноеИмя(ТипыЯзыкаРедактора(), "ВыраженияСКД");
	
КонецФункции

Функция ТипЯзыкаРедактораXML() Экспорт
	
	Возврат ПолноеИмя(ТипыЯзыкаРедактора(), "XML");
	
КонецФункции

Функция ПредставлениеОбъектовИмя() Экспорт
	
	Возврат ПолноеИмя(ПредставлениеОбъектов(), "Имя");
	
КонецФункции

Функция ПредставлениеОбъектовСиноним() Экспорт
	
	Возврат ПолноеИмя(ПредставлениеОбъектов(), "Синоним");
	
КонецФункции

#КонецОбласти

Функция Представление(Значение) Экспорт
	
	ПредставленияПеречислений = ПредставленияПеречислений();
	Результат = ПредставленияПеречислений.Получить(Значение);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		
		Шаблон = НСтр("ru = 'Не найдено представление перечисления: %1'; en = 'Enumeration view not found: %1'");
		ВызватьИсключение СтрШаблон(Шаблон, Значение);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьСписок(Элемент, Коллекция, Параметр = Неопределено) Экспорт
	
	Список = Элемент.СписокВыбора;
	Список.Очистить();
	
	Если Коллекция = ВидыПериодовПолученияФоновыхЗаданий() Тогда
		
		Список.Добавить(ВидПериодаПолученияФоновыхЗаданийВсеВремя());
		Список.Добавить(ВидПериодаПолученияФоновыхЗаданийПрошлаяНочь());
		Список.Добавить(ВидПериодаПолученияФоновыхЗаданийВчера());
		Список.Добавить(ВидПериодаПолученияФоновыхЗаданийСегодня());
		Список.Добавить(ВидПериодаПолученияФоновыхЗаданийПроизвольный());

	ИначеЕсли Коллекция = ЭлементыДанных() Тогда
	
		Список.Добавить(ЭлементДанныхЗапрос());
		Список.Добавить(ЭлементДанныхСхемаКомпоновкиДанных());
		
		Если Параметр = "Сравнение" Тогда
			Список.Добавить(ЭлементДанныхКод());
		КонецЕсли;
		
	ИначеЕсли Коллекция = Редакторы() Тогда
	
		Список.Добавить(РедакторОбычный());
		Список.Добавить(РедакторMonaco());
		
	ИначеЕсли Коллекция = ТипыХраненияДанных() Тогда
	
		Список.Добавить(ТипХраненияДанныхФайл());
		Список.Добавить(ТипХраненияДанныхНастройка());

	ИначеЕсли Коллекция = ВариантыВыводаРезультатаСКД() Тогда
	
		Список.Добавить(ВариантВыводаРезультатаСКДТабличныйДокумент());
		Список.Добавить(ВариантВыводаРезультатаСКДКоллекция());
		
	ИначеЕсли Коллекция = ВариантыСравненияДанных() Тогда
	
		Список.Добавить(ВариантСравненияДанныхТексты());
		Список.Добавить(ВариантСравненияДанныхРезультаты());
		
	ИначеЕсли Коллекция = ВидыРезультатаЗапроса() Тогда
	
		Список.Добавить(ВидРезультатаЗапросаЗапрос());
		
		Если Параметр > 1 Тогда // Количество запросов
			
			Список.Добавить(ВидРезультатаЗапросаПакет());
			
		КонецЕсли;
		
	ИначеЕсли Коллекция = ВидыГраницы() Тогда
	
		Список.Добавить(ВидГраницыВключая());
		Список.Добавить(ВидГраницыИсключая());
		
	ИначеЕсли Коллекция = ВидыВыводаТаблицы() Тогда
	
		Список.Добавить(ВидВыводаТаблицыВыводить());
		Список.Добавить(ВидВыводаТаблицыНеВыводить());
		Список.Добавить(ВидВыводаТаблицыСвернуто());
		
	ИначеЕсли Коллекция = ДействияСЗаменяемымиСсылками() Тогда
	
		Список.Добавить(ДействиеСЗаменяемойСсылкойНеУдалять());
		Список.Добавить(ДействиеСЗаменяемойСсылкойПометитьНаУдаление());
		Список.Добавить(ДействиеСЗаменяемойСсылкойУдалить());
		
	ИначеЕсли Коллекция = ПолучениеПлана() Тогда
	
		Список.Добавить(ПолучениеПланаОтключено());
		Список.Добавить(ПолучениеПланаТехнологическийЖурнал())
		
	ИначеЕсли Коллекция = РасшифровкаТаблицЗначений() Тогда
	
		Список.Добавить(РасшифровкаТаблицЗначенийОтключена());
		Список.Добавить(РасшифровкаТаблицЗначенийУпрощенная());
		Список.Добавить(РасшифровкаТаблицЗначенийПолная());
		
	ИначеЕсли Коллекция = ТипыТранзакцииОбработкиРезультата() Тогда
	
		Список.Добавить(ТипТранзакцииОбработкиРезультатаНеИспользовать());
		Список.Добавить(ТипТранзакцииОбработкиРезультатаПоСтроке());
		Список.Добавить(ТипТранзакцииОбработкиРезультатаНаВсе());
		
	ИначеЕсли Коллекция = ТипыЗначенияВнешнегоИсточника() Тогда
	
		Список.Добавить(ТипЗначенияВнешнегоИсточникаЗначение());
		Список.Добавить(ТипЗначенияВнешнегоИсточникаВыражение());
		
	ИначеЕсли Коллекция = ТипыЗначенияПараметровЗапроса() Тогда
	
		Список.Добавить(ТипЗначенияПараметраЗапросаЗначение());
		Если Параметр Тогда // список используется
			Список.Добавить(ТипЗначенияПараметраЗапросаСписок());
		КонецЕсли;
		Список.Добавить(ТипЗначенияПараметраЗапросаВыражение());
		
	ИначеЕсли Коллекция = ТипыКонструктораЗапроса() Тогда

		Если Параметр Тогда // Включая толстый
			Список.Добавить(ТипКонструктораЗапросаТолстый());
		КонецЕсли;
		Список.Добавить(ТипКонструктораЗапросаТонкий());
		Список.Добавить(ТипКонструктораЗапросаУлучшенныйТонкий());

	ИначеЕсли Коллекция = ТипыКонструктораСКД() Тогда

		Список.Добавить(ТипКонструктораСКДТолстый());
		Список.Добавить(ТипКонструктораСКДТонкий());

	КонецЕсли;

	Для Каждого ЭлементСписка Из Список Цикл
		
		ЭлементСписка.Представление = Представление(ЭлементСписка.Значение);
		
	КонецЦикла;
		
КонецПроцедуры

Функция ПредставленияПеречислений() Экспорт
	
	Результат = Новый Соответствие;
	
	// Инструменты
	Ключ = ИнструментКонсольРазработчика();
	Представление = НСтр("ru = 'Консоль рзаработчика'; en = 'Developer console'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ИнструментКонсольЗапросов();
	Представление = НСтр("ru = 'Консоль запросов'; en = 'Query console'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ИнструментКонсольСхемКомпоновкиДанных();
	Представление = НСтр("ru = 'Консоль схем компоновки данных'; en = 'Data composition schema console'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ИнструментКонсольКода();
	Представление = НСтр("ru = 'Консоль кода'; en = 'Code console'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ИнструментРедакторОбъекта();
	Представление = НСтр("ru = 'Редактор объекта'; en = 'Object editor'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ИнструментРедакторКонстант();
	Представление = НСтр("ru = 'Редактор констант'; en = 'Constant editor'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ИнструментРедакторПараметровСеанса();
	Представление = НСтр("ru = 'Редактор параметров сеанса'; en = 'Session parameter editor'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ИнструментПоискСсылокНаОбъект();
	Представление = НСтр("ru = 'Поиск ссылок на объект'; en = 'Search for object references'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ИнструментПоискИЗаменаСсылок();
	Представление = НСтр("ru = 'Поиск и замена ссылок'; en = 'Search and replace links'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ИнструментПодпискиНаСобытия();
	Представление = НСтр("ru = 'Подписки на события'; en = 'Event subscriptions'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ИнструментСравнениеОбъектов();
	Представление = НСтр("ru = 'Сравнение объектов'; en = 'Object comparison'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ИнструментПользователи();
	Представление = НСтр("ru = 'Пользователи'; en = 'Users'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ИнструментРегламентныеИФоновыеЗадания();
	Представление = НСтр("ru = 'Регламентные и фоновые задания'; en = 'Scheduled and background jobs'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ИнструментМониторЛицензий();
	Представление = НСтр("ru = 'Монитор лицензий'; en = 'License monitor'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ИнструментЖурналРегистрации();
	Представление = НСтр("ru = 'Журнал регистрации'; en = 'Registration log'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ИнструментОткрытьОбъект();
	Представление = НСтр("ru = 'Открыть объект'; en = 'Open object'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ИнструментАнализПравДоступа();
	Представление = НСтр("ru = 'Анализ прав доступа'; en = 'Access rights analysis'");
	Результат.Вставить(Ключ, Представление);
	
	// Редакторы
	Ключ = РедакторОбычный();
	Представление = НСтр("ru = 'Обычный (текстовый)'; en = 'Plain (text)'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = РедакторMonaco();
	Представление = НСтр("ru = 'Улучшенный (MS Monaco)'; en = 'Superior (MS Monaco)'");
	Результат.Вставить(Ключ, Представление);
	
	// ЭлементыДанных
	Ключ = ЭлементДанныхЗапрос();
	Представление = НСтр("ru = 'Запрос'; en = 'Query'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ЭлементДанныхГруппа();
	Представление = НСтр("ru = 'Группа'; en = 'Group'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ЭлементДанныхПодзапрос();
	Представление = НСтр("ru = 'Подзапрос'; en = 'SubQuery'");
	Результат.Вставить(Ключ, Представление);

	Ключ = ЭлементДанныхКод();
	Представление = НСтр("ru = 'Код'; en = 'Code'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ЭлементДанныхСхемаКомпоновкиДанных();
	Представление = НСтр("ru = 'Схема компоновки данных'; en = 'Data composition schema'");
	Результат.Вставить(Ключ, Представление);

	Ключ = ЭлементДанныхВариантОтчетаСКД();
	Представление = НСтр("ru = 'Вариант отчета СКД'; en = 'DCS report option'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ЭлементДанныхПользовательскаяНастройкаСКД();
	Представление = НСтр("ru = 'Пользовательская настройка СКД'; en = 'Customizing DCS'");
	Результат.Вставить(Ключ, Представление);
	
	// ВидыПериодовПолученияФоновыхЗаданий
	Ключ = ВидПериодаПолученияФоновыхЗаданийВсеВремя();
	Представление = НСтр("ru = 'Все время'; en = 'All time'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ВидПериодаПолученияФоновыхЗаданийСегодня();
	Представление = НСтр("ru = 'Сегодня'; en = 'Today'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ВидПериодаПолученияФоновыхЗаданийПрошлаяНочь();
	Представление = НСтр("ru = 'Прошлая ночь'; en = 'Last night'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ВидПериодаПолученияФоновыхЗаданийВчера();
	Представление = НСтр("ru = 'Вчера'; en = 'Yesterday'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ВидПериодаПолученияФоновыхЗаданийПроизвольный();
	Представление = НСтр("ru = 'Произвольный'; en = 'Arbitrary'");
	Результат.Вставить(Ключ, Представление);
	
	// ВариантыВыводаРезультатаСКД
	Ключ = ВариантВыводаРезультатаСКДТабличныйДокумент();
	Представление = НСтр("ru = 'Табличный документ'; en = 'Tabular document'");
	Результат.Вставить(Ключ, Представление);

	Ключ = ВариантВыводаРезультатаСКДКоллекция();
	Представление = НСтр("ru = 'Коллекция (таблица значений, дерево значений)'; en = 'Collection (table of values, tree of values)'");
	Результат.Вставить(Ключ, Представление);
	
	// ВариантыСравненияДанных
	Ключ = ВариантСравненияДанныхТексты();
	Представление = НСтр("ru = 'Тексты'; en = 'Texts'");
	Результат.Вставить(Ключ, Представление);

	Ключ = ВариантСравненияДанныхРезультаты();
	Представление = НСтр("ru = 'Результаты'; en = 'Results'");
	Результат.Вставить(Ключ, Представление);
	
	// ВидыРезультатаЗапроса
	Ключ = ВидРезультатаЗапросаЗапрос();
	Представление = НСтр("ru = 'Запрос'; en = 'Query'");
	Результат.Вставить(Ключ, Представление);

	Ключ = ВидРезультатаЗапросаПакет();
	Представление = НСтр("ru = 'Пакет'; en = 'Package'");
	Результат.Вставить(Ключ, Представление);
	
	// ВидыГраницы
	Ключ = ВидГраницыВключая();
	Представление = НСтр("ru = 'Включая'; en = 'Including'");
	Результат.Вставить(Ключ, Представление);

	Ключ = ВидГраницыИсключая();
	Представление = НСтр("ru = 'Исключая'; en = 'Excluding'");
	Результат.Вставить(Ключ, Представление);
	
	// ВидыВыводаТаблицы
	Ключ = ВидВыводаТаблицыВыводить();
	Представление = НСтр("ru = 'Выводить'; en = 'Output'");
	Результат.Вставить(Ключ, Представление);

	Ключ = ВидВыводаТаблицыНеВыводить();
	Представление = НСтр("ru = 'Не выводить'; en = 'Do not output'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ВидВыводаТаблицыСвернуто();
	Представление = НСтр("ru = 'Свернуто'; en = 'Minimized'");
	Результат.Вставить(Ключ, Представление);
	
	// ДействияСЗаменяемымиСсылками
	Ключ = ДействиеСЗаменяемойСсылкойНеУдалять();
	Представление = НСтр("ru = 'Не удалять'; en = 'Do not delete'");
	Результат.Вставить(Ключ, Представление);

	Ключ = ДействиеСЗаменяемойСсылкойПометитьНаУдаление();
	Представление = НСтр("ru = 'Пометить на удаление'; en = 'Flag for deletion'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ДействиеСЗаменяемойСсылкойУдалить();
	Представление = НСтр("ru = 'Удалить'; en = 'Delete'");
	Результат.Вставить(Ключ, Представление);
	
	// ПолучениеПлана
	Ключ = ПолучениеПланаОтключено();
	Представление = НСтр("ru = 'Отключено'; en = 'Off'");
	Результат.Вставить(Ключ, Представление);

	Ключ = ПолучениеПланаТехнологическийЖурнал();
	Представление = НСтр("ru = 'Технологический журнал'; en = 'Technology journal'");
	Результат.Вставить(Ключ, Представление);
	
	// РасшифровкаТаблицЗначений
	Ключ = РасшифровкаТаблицЗначенийОтключена();
	Представление = НСтр("ru = 'Отключена'; en = 'Disabled'");
	Результат.Вставить(Ключ, Представление);

	Ключ = РасшифровкаТаблицЗначенийУпрощенная();
	Представление = НСтр("ru = 'Упрощенная'; en = 'Simplified'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = РасшифровкаТаблицЗначенийПолная();
	Представление = НСтр("ru = 'Полная'; en = 'Full'");
	Результат.Вставить(Ключ, Представление);

	// ТипыТранзакцииОбработкиРезультата
	Ключ = ТипТранзакцииОбработкиРезультатаНеИспользовать();
	Представление = НСтр("ru = 'Не использовать'; en = 'Do not use'");
	Результат.Вставить(Ключ, Представление);

	Ключ = ТипТранзакцииОбработкиРезультатаПоСтроке();
	Представление = НСтр("ru = 'По строке'; en = 'By line'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ТипТранзакцииОбработкиРезультатаНаВсе();
	Представление = НСтр("ru = 'На все'; en = 'For all'");
	Результат.Вставить(Ключ, Представление);
	
	// ТипыЗначенияВнешнегоИсточника
	Ключ = ТипЗначенияВнешнегоИсточникаЗначение();
	Представление = НСтр("ru = 'Значение'; en = 'Value'");
	Результат.Вставить(Ключ, Представление);

	Ключ = ТипЗначенияВнешнегоИсточникаВыражение();
	Представление = НСтр("ru = 'Выражение'; en = 'Expression'");
	Результат.Вставить(Ключ, Представление);
	
	// ТипыЗначенияПараметровЗапроса
	Ключ = ТипЗначенияПараметраЗапросаЗначение();
	Представление = НСтр("ru = 'Значение'; en = 'Value'");
	Результат.Вставить(Ключ, Представление);

	Ключ = ТипЗначенияПараметраЗапросаСписок();
	Представление = НСтр("ru = 'Список'; en = 'List'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ТипЗначенияПараметраЗапросаВыражение();
	Представление = НСтр("ru = 'Выражение'; en = 'Expression'");
	Результат.Вставить(Ключ, Представление);
	
	// ТипыКонструктораЗапроса
	Ключ = ТипКонструктораЗапросаТолстый();
	Представление = НСтр("ru = 'Толстый (классический)'; en = 'Thick (classic)'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ТипКонструктораЗапросаТонкий();
	Представление = НСтр("ru = 'Тонкий'; en = 'Thin'");
	Результат.Вставить(Ключ, Представление);

	Ключ = ТипКонструктораЗапросаУлучшенныйТонкий();
	Представление = НСтр("ru = 'Тонкий (улучшенный)'; en = 'Thin (improved)'");
	Результат.Вставить(Ключ, Представление);

	// ТипыКонструктораСКД
	Ключ = ТипКонструктораСКДТолстый();
	Представление = НСтр("ru = 'Толстый (классический)'; en = 'Thick (classic)'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ТипКонструктораСКДТонкий();
	Представление = НСтр("ru = 'Toolkit (тестовый)'; en = 'Toolkit (test)'");
	Результат.Вставить(Ключ, Представление);
	
	// ТипыХраненияДанных
	Ключ = ТипХраненияДанныхФайл();
	Представление = НСтр("ru = 'Файл'; en = 'File'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = ТипХраненияДанныхНастройка();
	Представление = НСтр("ru = 'Настройка'; en = 'Settings'");
	Результат.Вставить(Ключ, Представление);
	
	// АлгоритмыОбработкиТекста
	Ключ = АлгоритмОбработкиТекстаЗакомментировать();
	Представление = НСтр("ru = 'Закомментировать'; en = 'Comment out'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = АлгоритмОбработкиТекстаУбратьКомментарии();
	Представление = НСтр("ru = 'Убрать комментарии'; en = 'Remove comments'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = АлгоритмОбработкиТекстаПереносЗапросаИзКонфигуратора();
	Представление = НСтр("ru = 'Убрать переносы'; en = 'Remove transfers'");
	Результат.Вставить(Ключ, Представление);

	Ключ = АлгоритмОбработкиТекстаДобавитьПереносыСтрок();
	Представление = НСтр("ru = 'Добавить перенос строки'; en = 'Add line break'");
	Результат.Вставить(Ключ, Представление);

	Ключ = АлгоритмОбработкиТекстаУбратьПереносыСтрок();
	Представление = НСтр("ru = 'Убрать перенос строки'; en = 'Remove line break'");
	Результат.Вставить(Ключ, Представление);

	// СКДТипыОтчетаКонструктораНастроекКомпоновкиДанных
	Ключ = СКДТипОтчетаКонструктораНастроекКомпоновкиДанныхСписок();
	Представление = НСтр("ru = 'Список. Данные по всем измерениям отчета выводятся списком.'; en = 'List. Data for all dimensions of the report is displayed as a list.'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = СКДТипОтчетаКонструктораНастроекКомпоновкиДанныхТаблица();
	Представление = НСтр("ru = 'Таблица. Данные выводятся по измерениям расположенным как по горизонтали, так и по вертикали.';
						|en = 'Table. The data is displayed both horizontally and vertically.'");
	Результат.Вставить(Ключ, Представление);
	
	Ключ = СКДТипОтчетаКонструктораНастроекКомпоновкиДанныхДиаграмма();
	Представление = НСтр("ru = 'Диаграмма. Данные выводяться в виде диаграммы.'; en = 'Diagram. The data is displayed in the form of a diagram.'");
	Результат.Вставить(Ключ, Представление);

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПрефиксПеречислений()
	
	Возврат "П";
	
КонецФункции

Функция ПолноеИмяКоллекции(Имя)
	
	Возврат СтрШаблон("%1.%2", ПрефиксПеречислений(), Имя);
	
КонецФункции

Функция ПолноеИмя(Коллекция, Имя)
	
	Возврат СтрШаблон("%1.%2", Коллекция, Имя);
	
КонецФункции

#КонецОбласти
