#Область ПрограммныйИнтерфейс

Функция ОбработкаОповещения(Форма, ИмяСобытия, ВидИнструмента = Неопределено) Экспорт
	
	Если ИмяСобытия = ИТК_НастройкиКлиентСервер.ИмяСобытияНастройкиИзменены() Тогда
		
		ВсеНастройки = ИТК_НастройкиВызовСервера.ЗагрузитьВсе(ВидИнструмента);
		ЗаполнитьЗначенияСвойств(Форма, ВсеНастройки);
		
		Результат = Истина;
		
	Иначе
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеОбщейНастройки(Форма, Имя) Экспорт
	
	Возврат ИТК_НастройкиКлиентСервер.ЗначениеОбщейНастройки(Форма, Имя);
	
КонецФункции

Функция ЗначениеНастройки(Форма, Имя) Экспорт
	
	Возврат ИТК_НастройкиКлиентСервер.ЗначениеНастройки(Форма, Имя);
	
КонецФункции

#КонецОбласти
