#Область ПрограммныйИнтерфейс

// Копирует текст в буфер обмена (Через HTML)
//
// Параметры:
//	Текст - Строка - Текст
Процедура Копировать(Текст) Экспорт
	
	// Вариант проблемный в RDP https://forum.infostart.ru/forum9/topic10315/
	ОбъектHTML = Новый COMОбъект("htmlfile");
	ОбъектHTML.ParentWindow.ClipboardData.Setdata("Text", Текст);
	
	Если Текст = Текст() Тогда
		Возврат;
	КонецЕсли;
	
	#Если НЕ ВебКлиент Тогда
		
		// Этот вариант работает в RDP но тоже проблемный
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(Текст);
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		ТекстовыйДокумент.НачатьЗапись(, ИмяВременногоФайла, КодировкаТекста.OEM, Символы.ПС);
		
		WScriptShell = Новый COMОбъект("WScript.Shell");
		
		Шаблон = "%%comspec%% /c type ""%1"" | clip & del ""%1""";
		WScriptShell.Run(СтрШаблон(Шаблон, ИмяВременногоФайла), 0, 0);
		
	#КонецЕсли
	
КонецПроцедуры

// Получает текст из буфера обмена
//
// Возвращаемое значение:
//   Строка	- Содержимое буфера обмена
Функция Текст() Экспорт
	
	htmlfile = Новый COMОбъект("htmlfile");
	Возврат htmlfile.ParentWindow.ClipboardData.Getdata("Text");
	
КонецФункции

#КонецОбласти
