#Область ПрограммныйИнтерфейс

Функция ЗначениеОбщейНастройки(Форма, Имя) Экспорт
	
	Настройки = Форма[ИмяРеквизитаНастройкиОбщие()];
	Возврат Настройки[Имя];
	
КонецФункции

Функция ЗначениеНастройки(Форма, Имя) Экспорт
	
	Настройки = Форма[ИмяРеквизитаНастройки()];
	Возврат Настройки[Имя];
	
КонецФункции

Функция КлючОбъекта() Экспорт
	
	Возврат "Infostart Toolkit";
	
КонецФункции

Функция ИмяСобытияНастройкиИзменены() Экспорт
	
	Возврат "НастройкиИзменены";
	
КонецФункции

Функция ИмяРеквизитаНастройкиОбщие() Экспорт
	
	Возврат "НастройкиОбщие";
	
КонецФункции

Функция ИмяРеквизитаНастройки() Экспорт
	
	Возврат "Настройки";
	
КонецФункции

#КонецОбласти
