#Область ПрограммныйИнтерфейс

Функция ИспользуетсяБСП() Экспорт
	
	Возврат ИТКВ_БСПВызовСервера.ИспользуетсяБСП();
	
КонецФункции

Функция Версия() Экспорт
	
	Возврат ИТКВ_БСПВызовСервера.Версия();
	
КонецФункции

Функция АнглийскийИдентификаторСтандартнойОбработки(Идентификатор) Экспорт
	
	СоответствиеИмен = Новый Соответствие;
	СоответствиеИмен.Вставить("ГрупповоеИзменениеРеквизитов", "BatchEditAttributes");
	СоответствиеИмен.Вставить("ЖурналРегистрации", "EventLog");
	СоответствиеИмен.Вставить("ПоискИУдалениеДублей", "DuplicateObjectsDetection");
	СоответствиеИмен.Вставить("УдалениеПомеченныхОбъектов", "MarkedObjectsDeletion");
	
	Возврат СоответствиеИмен.Получить(Идентификатор);
	
КонецФункции

Функция ОбщийМодуль(Имя) Экспорт
	
	ИмяМодуля = ИмяМодуля(Имя);
	Возврат ИТКВ_МетаданныеКлиентСерверПовтИсп.ОбщийМодуль(ИмяМодуля);
	
КонецФункции

Функция ИмяМодуля(Имя) Экспорт
	
	Результат = Имя;
	Если АнглийскаяБСП() Тогда
		Результат = ИмяМодуляНаАнглийском(Имя);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИмяФункцииМодуля(Имя) Экспорт
	
	Результат = Имя;
	Если АнглийскаяБСП() Тогда
		Результат = ИмяМетодаНаАнглийском(Имя);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция АнглийскаяБСП() Экспорт
	
	Возврат ИТКВ_БСПВызовСервера.АнглийскаяБСП();
	
КонецФункции

Функция РусскаяБСП() Экспорт
	
	Возврат НЕ АнглийскаяБСП();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяМодуляНаАнглийском(Имя)
	
	СоответствиеИмен = Новый Соответствие;
	СоответствиеИмен.Вставить("ОбщегоНазначения", "CommonUtil");
	СоответствиеИмен.Вставить("ОбщегоНазначенияПовтИсп", "CommonUtilCached");
	СоответствиеИмен.Вставить("СтандартныеПодсистемыСервер", "StandardSubsystemsServer");
	СоответствиеИмен.Вставить("РегламентныеЗаданияСервер", "ScheduledJobsServer");
	СоответствиеИмен.Вставить("РегламентныеЗаданияСлужебный", "ScheduledJobsInternal");
	СоответствиеИмен.Вставить("ДлительныеОперации", "TimeConsumingOperations");
	СоответствиеИмен.Вставить("ДлительныеОперацииКлиент", "TimeConsumingOperationsClient");
	СоответствиеИмен.Вставить("УправлениеСвойствами", "PropertyManager");
	СоответствиеИмен.Вставить("ЗапретРедактированияРеквизитовОбъектов", "ObjectAttributesLock");
	СоответствиеИмен.Вставить("ЗапретРедактированияРеквизитовОбъектовСлужебный", "ObjectAttributesLock");
	СоответствиеИмен.Вставить("УправлениеСвойствами", "PropertyManager");
	
	Результат = СоответствиеИмен.Получить(Имя);
	Если Результат = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Неизвестное имя модуля %1 для английской БСП", Имя);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИмяМетодаНаАнглийском(Имя)
	
	СоответствиеИмен = Новый Соответствие;
	СоответствиеИмен.Вставить("ВерсияБиблиотеки", "LibraryVersion");
	СоответствиеИмен.Вставить("ПодсистемаСуществует", "SubsystemExists");
	СоответствиеИмен.Вставить("РегламентныеЗаданияЗависимыеОтФункциональныхОпций", "ScheduledJobsDependentOnFunctionalOptions");
	СоответствиеИмен.Вставить("РегламентноеЗаданиеДоступноПоФункциональнымОпциям", "ScheduledJobAvailableByFunctionalOptions");
	СоответствиеИмен.Вставить("ПолучитьОбщийСписокИсключенийПоискаСсылок", "RefSearchExceptions");
	СоответствиеИмен.Вставить("ИсключенияПоискаСсылок", "RefSearchExceptions");
	СоответствиеИмен.Вставить("РазделениеВключено", "DataSeparationEnabled");
	СоответствиеИмен.Вставить("ПолучитьСписокСвойств", "GetPropertyList");
	СоответствиеИмен.Вставить("ПолучитьЗначенияСвойств", "GetValuesProperties");
	СоответствиеИмен.Вставить("БлокируемыеРеквизитыОбъекта", "ObjectAttributesToLock");
	СоответствиеИмен.Вставить("ИспользоватьДопРеквизиты", "UseAddlAttributes");
	СоответствиеИмен.Вставить("ИспользоватьДопСведения", "UseAddlInfo");
	СоответствиеИмен.Вставить("РаботаСВнешнимиРесурсамиЗаблокирована", "OperationsWithExternalResourcesLocked");
	СоответствиеИмен.Вставить("РазрешитьРаботуСВнешнимиРесурсами", "UnlockOperationsWithExternalResources");
	
	// ДлительныеОперации
	СоответствиеИмен.Вставить("ЗаданиеВыполнено", "JobCompleted");
	СоответствиеИмен.Вставить("СообщитьПрогресс", "ReportProgress");
	СоответствиеИмен.Вставить("ПараметрыВыполненияВФоне", "FunctionExecutionParameters");
	СоответствиеИмен.Вставить("ВыполнитьВФоне", "ExecuteInBackground");
	СоответствиеИмен.Вставить("ОтменитьВыполнениеЗадания", "CancelJobExecution");
	
	// ДлительныеОперацииКлиент
	СоответствиеИмен.Вставить("ИнициализироватьПараметрыОбработчикаОжидания", "InitIdleHandlerParameters");
	СоответствиеИмен.Вставить("ПараметрыОжидания", "IdleParameters");
	СоответствиеИмен.Вставить("ОжидатьЗавершение", "WaitCompletion");
	
	Результат = СоответствиеИмен.Получить(Имя);
	Если Результат = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Неизвестное имя функции %1 для английской БСП", Имя);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
