#Область ПрограммныйИнтерфейс

Процедура ОбработкаКомандыОткрытиеСтандартнойОбработки(Идентификатор, ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	ПолноеИмяФормы = ИТКВ_БСПВызовСервера.ПолноеИмяФормыСтандартнойОбработки(Идентификатор);
	
	Если НЕ ЗначениеЗаполнено(ПолноеИмяФормы) Тогда
		
		ИдентификаторАнглийский = ИТКВ_БСПКлиентСерверПовтИсп.АнглийскийИдентификаторСтандартнойОбработки(Идентификатор);
		ШаблонТекста = НСтр("ru = 'Отсутствует стандартная обработка %1 (%2) (БСП)';
							|en = 'Missing standard processing %2 (%1) (SSL)'");
		Текст = СтрШаблон(ШаблонТекста, Идентификатор, ИдентификаторАнглийский);
		Заголовок = ИТКВ_ТуллкитКлиентСервер.Представление();
		ПоказатьПредупреждение( , Текст, , Заголовок);
		
		Возврат;
		
	КонецЕсли;
	
	ОткрытьФорму(ПолноеИмяФормы, , ПараметрыВыполненияКоманды.Источник,	ПараметрыВыполненияКоманды.Уникальность,
								ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
	
#КонецОбласти
