// BSLLS-off
// @strict-types
////////////////////////////////////////////////////////////////////////////////
// РЗ_инт_МенеджерПотоковРассылкиСообщений
// Юнит-тесты для регламентного задания рассылки сообщений
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ДобавитьТестовыйНабор("РасписаниеПоУмолчанию")
		.ДобавитьТест("ЗаданиеРассылкиЗапускаетсяРазВТриСекунды");
	
КонецПроцедуры

#КонецОбласти

#Область Тесты

Процедура ЗаданиеРассылкиЗапускаетсяРазВТриСекунды() Экспорт
	
	Задание = РегламентныеЗадания.НайтиПредопределенное(
		Метаданные.РегламентныеЗадания.инт_МенеджерПотоковРассылкиСообщений);
	
	ЮТест.ОжидаетЧто(Задание.Расписание.ПериодПовтораВТечениеДня, "Период повтора в течение дня")
		.Равно(3);
	
КонецПроцедуры

#КонецОбласти
