// BSLLS-off
// @strict-types

/////////////////////////////////////////////////////////////////////////////////
// Экспортные процедуры и функции, предназначенные для использования другими
// объектами конфигурации или другими программами
/////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт

    ЮТТесты.УдалениеТестовыхДанных().ВТранзакции()
    .ДобавитьТест("ОсиротевшийСтатусУдаляетсяСанитарнойОчисткой");

КонецПроцедуры

#Область События

Процедура ПередВсемиТестами() Экспорт

КонецПроцедуры

Процедура ПередКаждымТестом() Экспорт

КонецПроцедуры

Процедура ПослеКаждогоТеста() Экспорт

КонецПроцедуры

Процедура ПослеВсехТестов() Экспорт

КонецПроцедуры

#КонецОбласти

Процедура ОсиротевшийСтатусУдаляетсяСанитарнойОчисткой() Экспорт

    ПотокДанных = ГенераторТестовыхДанных.ПотокДанныхВходящий();
    ИдентификаторСообщения = РегистрыСведений.инт_ОчередьВходящихСообщений.ЗарегистрироватьСообщение(
        Новый Структура("Hello", "world"), ПотокДанных);

    ОсиротевшийИдентификатор = Новый УникальныйИдентификатор;
    РегистрыСведений.инт_ТекущийСтатусВходящихСообщений.ЗаписатьСтатусСообщения(
        ОсиротевшийИдентификатор, Перечисления.инт_СтатусыВходящихСообщений.Новый);

    инт_СервисныеДействия.УдалитьОсиротевшиеСтатусыВходящихСообщений();

    ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.инт_ТекущийСтатусВходящихСообщений")
        .СодержитЗаписи(ЮТест.Предикат().Реквизит("ИдентификаторСообщения").Равно(ИдентификаторСообщения));

    ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.инт_ТекущийСтатусВходящихСообщений")
        .НеСодержитЗаписи(ЮТест.Предикат().Реквизит("ИдентификаторСообщения").Равно(ОсиротевшийИдентификатор));

    ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.инт_ИсторияСтатусовВходящихСообщений")
        .НеСодержитЗаписи(ЮТест.Предикат().Реквизит("ИдентификаторСообщения").Равно(ОсиротевшийИдентификатор));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
