////////////////////////////////////////////////////////////////////////////////
// инт_СервисныеДействия
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Процедура - Инт очистка устаревших сообщений
Процедура инт_ОчисткаУстаревшихСообщений() Экспорт
	МассивФоновыхЗаданий = Новый массив;
	МассивФоновыхЗаданий.Добавить(ФоновыеЗадания.Выполнить("инт_СервисныеДействия.ОчиститьОчередьИсходящихСообщений",,,"Фоновая очистка очереди исходящих сообщений."));
	МассивФоновыхЗаданий.Добавить(ФоновыеЗадания.Выполнить("инт_СервисныеДействия.ОчиститьОчередьВходящихСообщений",,,"Фоновая очистка очереди входящих сообщений."));
	
	МассивФоновыхЗаданий = ФоновыеЗадания.ОжидатьЗавершенияВыполнения(МассивФоновыхЗаданий);
	
	Для Каждого ФоновоеЗадание Из МассивФоновыхЗаданий Цикл
		Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно ИЛИ ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
			 СообщениеОбОшибке = СтрШаблон("В процессе очистки очередей от устаревших данных произошла ошибка!
				| В фоновое задание <%1> завершено с ошибкой
				| Сведения об ошибке: %2", ФоновоеЗадание.Наименование, ФоновоеЗадание.ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.ОчисткаУстаревшихСообщений",УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке);
			ВызватьИсключение СообщениеОбОшибке;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
Процедура ОчиститьОчередьИсходящихСообщений() Экспорт
		РегистрыСведений.инт_СообщенияКУдалению.ОчиститьОчередьИсходящихСообщений();
КонецПроцедуры

Процедура ОчиститьОчередьВходящихСообщений() Экспорт
		РегистрыСведений.инт_СообщенияКУдалению.ОчиститьОчередьВходящихСообщений();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
