#Область ПрограммныйИнтерфейс

Функция ОбработкаСобытияПолученияМетаданных(Метаданные) Экспорт
	
	Возврат ИТКВ_РедакторКода.ОбработкаСобытияПолученияМетаданных(Метаданные);
	
КонецФункции

Функция ДанныеПакетаУлучшенногоРедактораКода() Экспорт
	
	Возврат ПолучитьОбщийМакет("ИТКВ_РедакторКодаMonaco");
	
КонецФункции

Функция ПользовательскиеОбъектыВJSONСтроку(Объекты) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("customObjects", Объекты);
	
	Возврат ИТКВ_ОбщийКлиентСервер.КоллекциюВJSONСтроку(Результат);
	
КонецФункции

Функция ПользовательскиеОбъектыОбработкаРезультатов(Данные, АдресОбрабатываемыхДанных, Имя) Экспорт
	
	Возврат ИТКВ_РедакторКода.ПользовательскиеОбъектыОбработкаРезультатов(Данные, АдресОбрабатываемыхДанных, Имя);
	
КонецФункции

Функция ПользовательскиеОбъектыВыраженияСКД(Контекст) Экспорт
	
	Возврат ИТКВ_РедакторКода.ПользовательскиеОбъектыВыраженияСКД(Контекст);
	
КонецФункции

Функция ПользовательскиеОбъектыРезультат() Экспорт
	
	Возврат ИТКВ_РедакторКода.ПользовательскиеОбъектыРезультат();
	
КонецФункции

Функция ОписаниеОбщихМодулейJSON(Клиент = Истина, Сервер = Истина) Экспорт
	
	Возврат ИТКВ_РедакторКодаПовтИсп.ОписаниеОбщихМодулейJSON(Клиент, Сервер);
	
КонецФункции

Функция ИмяОбъектаМетаданныхВ1С(ИмяКоллекции, ИмяОбъекта) Экспорт
	
	ОбъектМетаданных = Метаданные[ИмяКоллекции].Найти(ИмяОбъекта);
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбъектМетаданных.Имя;
	
КонецФункции

Функция ЗагрузитьНастройкиРедактора() Экспорт
	
	ОбщиеНастройки = ИТКВ_Настройки.Загрузить();
	
	Результат = Новый Структура;
	Результат.Вставить("ОтображатьКарту", ОбщиеНастройки.РедакторОтображатьКарту);
	Результат.Вставить("ОтображатьНомераСтрок", ОбщиеНастройки.РедакторОтображатьНомераСтрок);
	Результат.Вставить("ОтображатьПробелыИТабуляции", ОбщиеНастройки.РедакторОтображатьПробелыИТабуляции);
	Результат.Вставить("ОтображатьСостояние", ОбщиеНастройки.РедакторОтображатьСостояние);
	Результат.Вставить("Шрифт", ОбщиеНастройки.РедакторШрифт);
	Результат.Вставить("ПутьКФайлуШаблоновКода", ОбщиеНастройки.РедакторКодаПутьКФайлуШаблонов);
	Результат.Вставить("ЯзыкПрограммирования", ИТКВ_Общий.КодЯзыкаПрограммирования());
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
