#Область ПрограммныйИнтерфейс

Функция ПутьКФайлам() Экспорт
	
	ВсеНастройки = ИТКВ_НастройкиВызовСервера.ЗагрузитьВсе();
	ОбщиеНастройки = ВсеНастройки[ИТКВ_НастройкиКлиентСервер.ИмяРеквизитаНастройкиОбщие()];
		
	Возврат ОбщиеНастройки["ВыгруженныеФайлы"];
	
КонецФункции

Функция ТекстМодуля(Путь, ОписаниеМодуля) Экспорт
	
	ПолноеИмяФайла = ИТКВ_ФайлыКонфигурацииКлиентСервер.ПолноеИмяФайлаМодуля(Путь, ОписаниеМодуля);
	
	Файл = Новый Файл(ПолноеИмяФайла);
	
	Если НЕ Файл.Существует() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ПолноеИмяФайла);
	
	Возврат ТекстовыйДокумент.ПолучитьТекст();
	
КонецФункции

#КонецОбласти
