#Область ПрограммныйИнтерфейс

// Удаляет данные из временного хранилища
//
// Параметры:
//	Данные - Строка, Массив - Адрес во временном хранилище или массив адресов
//
Процедура Удалить(Данные) Экспорт
	
	ИТК_ВременноеХранилище.Удалить(Данные);
	
КонецПроцедуры

// Помещает значение во временное хранилище
//
// Параметры:
//  Значение  - Произвольный - Произвольное значение
//  Адрес  - Строка - Адрес во временном хранилище
//  УникальныйИдентификатор  - УникальныйИдентификатор - Уникальный идентификатор
//
// Возвращаемое значение:
//   Строка - Адрес во временном хранилище
//
Функция Поместить(Значение, Адрес = Неопределено, УникальныйИдентификатор = Неопределено) Экспорт
	
	Возврат ИТК_ВременноеХранилище.Поместить(Значение, Адрес, УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти
