#Область ПрограммныйИнтерфейс

// Возвращает XML текст для объекта системы компоновки данных
//
// Параметры:
//   Объект - Строка - Адрес (объекта системы компоновки данных) во временном хранилище содержащий значения: СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных,
//				ПользовательскиеНастройкиКомпоновкиДанных
//
// Возвращаемое значение:
//   Строка - XML текст объекта
//
Функция XMLТекст(Адрес) Экспорт
	
	Объект = ПолучитьИзВременногоХранилища(Адрес);
	Возврат ИТКВ_СКД.XMLТекст(Объект);
	
КонецФункции

// Возвращает схему компоновки данных по XML тексту
//
// Параметры:
//   Текст - Строка - XML текст схемы
//
// Возвращаемое значение:
//   СхемаКомпоновкиДанных - Схема компоновки данных
//
Функция СхемаКомпоновкиДанных(Текст) Экспорт
	
	Возврат ИТКВ_СКД.СхемаКомпоновкиДанных(Текст);

КонецФункции

// Проверяет текст схемы компоновки данных, собирает данные внешних источников
//
// Параметры:
//	Текст - Строка - XML текст схемы компоновки данных
//
// Возвращаемое значение:
//	Структура - Результат проверки
//
Функция ПроверитьТекст(Текст) Экспорт
	
	Возврат ИТКВ_СКД.ПроверитьТекст(Текст);
	
КонецФункции

// Проверяет текст схемы компоновки данных
//
// Параметры:
//	АдресДанныхРасшифровки - Строка - Адрес данных расшифровки во временном хранилище
//	ИдентификаторРасшифровки - Число - Идентификатор расшифровки
//
// Возвращаемое значение:
//	Произвольный - Значение расшифровки области
//
Функция РасшифровкаОбласти(АдресДанныхРасшифровки, ИдентификаторРасшифровки) Экспорт
	
	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресДанныхРасшифровки);
	Возврат ДанныеРасшифровки.Элементы[ИдентификаторРасшифровки].ПолучитьПоля()[0].Значение;
	
КонецФункции

Процедура СкопироватьСтруктурноеПоле(Приемник, Источник) Экспорт
	
	ИТКВ_СКД.СкопироватьСтруктурноеПоле(Приемник, Источник);

КонецПроцедуры

#КонецОбласти
