///////////////////////////////////////////////////////////////////////////////
// инт_ПодписчикиПодсистемаИнтеграции (Модуль менеджера)
// Подписчики для отправки в другую базу с подсистемой интеграции
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует сообщение для отправки
//
// Параметры:
//  ДанныеСообщения - Соответствие - Данные для сериализации
//  Подписчик - СправочникСсылка.инт_ПодписчикиПодсистемаИнтеграции - Ссылка на подписчика
//  ИдентификаторСообщения - УникальныйИдентификатор - УИД сообщения
//
// Возвращаемое значение:
//  Строка - Сериализованное сообщение
//
Функция СформироватьСообщение(ДанныеСообщения, Подписчик, ИдентификаторСообщения) Экспорт
    
    Возврат инт_КоннекторHTTP.ОбъектВJson(ДанныеСообщения);
    
КонецФункции

// Отправляет сообщение подписчику
//
// Параметры:
//  Сообщение - Структура - Данные сообщения (ИдентификаторСообщения, Подписчик, СформированноеСообщение)
//  ОтложенныеДействия - Соответствие - Для пакетной обработки
//
Процедура ОтправитьСообщение(Сообщение, ОтложенныеДействия) Экспорт
    
    // Получим поток данных, он будет необходим для отправки
    ДанныеИсходящегоСообщения = РегистрыСведений.инт_ОчередьИсходящихСообщений.ПолучитьДанныеОчередиПоИдентификатору(
        Сообщение.ИдентификаторСообщения,
        "ПотокДанных, ИсходныеДанные");
    
    ПотокДанных = ДанныеИсходящегоСообщения.ПотокДанных;
    Подписчик = Сообщение.Подписчик;
    
    СтруктураПараметровСоединения = Справочники.инт_Эндпоинты.СтруктураПараметровСоединения(Подписчик.Эндпоинт);
    
    // URL по шаблону подсистемы интеграции
    URL = СтрШаблон("%1/hs/api/v1/%2/%3",
        СтруктураПараметровСоединения.АдресРесурса,
        ПотокДанных.Код,
        Сообщение.ИдентификаторСообщения);
    
    Заголовки = Новый Соответствие;
    Заголовки.Вставить("X-Message-ID", Строка(Сообщение.ИдентификаторСообщения));
    
    Ответ = инт_КоннекторHTTP.Post(URL, Сообщение.СформированноеСообщение, Заголовки, СтруктураПараметровСоединения.Сессия);
    
    // Постобработка по коду ответа
    ВыполнитьПостПроцессинг(Подписчик, Ответ, ДанныеИсходящегоСообщения.ИсходныеДанные);
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выполняет постобработку по коду состояния HTTP-ответа
//
// Параметры:
//  Подписчик - СправочникСсылка.инт_ПодписчикиПодсистемаИнтеграции - Ссылка на подписчика
//  Ответ - Структура - Ответ HTTP-сервера (КодСостояния, Тело)
//  ИсходныеДанные - ОпределяемыйТип.инт_ИсходныеДанные - Ссылка на исходные данные сообщения
//
Процедура ВыполнитьПостПроцессинг(Подписчик, Ответ, ИсходныеДанные = Неопределено)
    
    КодСостояния = Ответ.КодСостояния;
    Код = ПолучитьОбработчикПоКодуСостояния(КодСостояния, Подписчик);
    
    Попытка
        Исполнить(Код, Ответ, ИсходныеДанные, Истина);
    Исключение
        ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); // BSLLS:DeprecatedMethods8317-off
        СообщениеОбОшибке = СтрШаблон("При пост-обработке ответа возникла ошибка!
        |
        | Информация об ошибке: %1",
        ПредставлениеОшибки);
        
        ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.Подписчики.ПостОбработкаОтвета",
                                    УровеньЖурналаРегистрации.Ошибка,
                                    ,
                                    ,
                                    СообщениеОбОшибке);
        ВызватьИсключение;
    КонецПопытки;
    
КонецПроцедуры

Функция ПолучитьОбработчикПоКодуСостояния(КодСостояния, Подписчик)
    
    Обработчик = "";
    СтрокаПостПроцессинга = Подписчик.ПостПроцессинг.Найти(КодСостояния, "КодСостояния");
    
    Если СтрокаПостПроцессинга <> Неопределено Тогда
        Обработчик = СтрокаПостПроцессинга.Обработчик;
    Иначе
        Обработчик = ПолучитьОбработчикПоУмолчанию(КодСостояния);
    КонецЕсли;
    
    Возврат Обработчик;
    
КонецФункции

Функция ПолучитьОбработчикПоУмолчанию(КодСостояния)
    
    Обработчик = "";
    // Здесь через ИначеЕсли можно определить базовое поведение для разных кодов состояний.
    // Если их будет много - вынести в регистр
    Если НЕ (КодСостояния >= 200 И КодСостояния < 300) Тогда // BSLLS:MagicNumber-off ну коды http-то все знают
        Обработчик = "СообщениеОбОшибке = СтрШаблон(""При попытке отправки сообщения код ответа отличается от ожидаемого!
            |	|Код состояния: %1
            |	|ТелоОтвета: %2"", Ответ.КодСостояния, ПолучитьСтрокуИзДвоичныхДанных(Ответ.Тело));
            |ВызватьИсключение Строка(Ответ.Тело);";
    КонецЕсли;
    Возврат Обработчик;
    
КонецФункции

Процедура Исполнить(Код, Ответ, ИсходныеДанные, РазрешитьФиксациюИзменений = Ложь)
    // Проверки в процедуре отключены, т.к. это запланированное поведение.
    УстановитьБезопасныйРежим(Истина);
    НачатьТранзакцию();
    Попытка
        // BSLLS:ExecuteExternalCodeInCommonModule-off
        Выполнить(Код);
        // BSLLS:ExecuteExternalCodeInCommonModule-on
        Если РазрешитьФиксациюИзменений Тогда
            ЗафиксироватьТранзакцию(); // BSLLS:CommitTransactionOutsideTryCatch-off
        Иначе
            // Для исходящих потоков или проверок фиксация изменений не нужна.
            ОтменитьТранзакцию(); // BSLLS:WrongUseOfRollbackTransactionMethod-off
        КонецЕсли;
        
    Исключение
        ОтменитьТранзакцию(); // BSLLS:PairingBrokenTransaction-off
        ВызватьИсключение;
    КонецПопытки;
    УстановитьБезопасныйРежим(Ложь); // BSLLS:DisableSafeMode-off
    
КонецПроцедуры

#КонецОбласти
