///////////////////////////////////////////////////////////////////////////////
// Модуль: инт_РаботаССообщениямиRabbitMQ
//
// Описание:
//  Модуль для работы с подписчиками типа RabbitMQ.
//  Реализует формирование и отправку сообщений в очередь RabbitMQ.
//
// Основные возможности:
//  - Сериализация сообщений в формат JSON для RabbitMQ
//  - Отправка сообщений в очередь RabbitMQ
//
// Примечание:
//  Функционал находится в разработке и не готов к использованию.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция - Сформировать сообщение по подписчику
//
// Параметры:
//  ДанныеСообщения        - Соответствие                   - Соответствие содержащее данные для сериализации
//  Подписчик              - СправочникСсылка.инт_Подписчики - Ссылка на подписчика
//  ИдентификаторСообщения - УникальныйИдентификатор        - УИД сообщения
// 
// Возвращаемое значение:
//  Строка - Сериализованное, готовое к отправке подписчику сообщение
//
Функция СформироватьСообщениеПоПодписчику(ДанныеСообщения, Подписчик, ИдентификаторСообщения) Экспорт
    // Пока так. 
    // В теории тут могут быть манипуляции с сообщением. Сериализация в xml, подсовывание других параметров сериализации(не знаю, форматы дат-там другие и тд)
    // но пока просто в json для mvp
    Возврат инт_КоннекторHTTP.ОбъектВJson(ДанныеСообщения);
		
КонецФункции

// Процедура - Отправить сообщение подписчику
//
// Параметры:
//  Сообщение     - Структура - Данные сообщения 
//
Процедура ОтправитьСообщение(Сообщение) Экспорт
   //TODO: Надо сделать
   ВызватьИсключение "Обмен с Rabbit Пока ну совсем не готов";
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
