#Область ПрограммныйИнтерфейс

Функция ВыполнитьФункцию(ПолноеИмя, Параметры = Неопределено) Экспорт
	
	Результат = Истина;
	ВыполнитьМетод(ПолноеИмя, Параметры, Результат);
	
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьПроцедуру(ПолноеИмя, Параметры = Неопределено) Экспорт
	
	ВыполнитьМетод(ПолноеИмя, Параметры);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьМетод(ПолноеИмя, Параметры, Результат = Неопределено)
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Массив;
	КонецЕсли;
	
	ЧастиИмени = СтрРазделить(ПолноеИмя, ".");
	ИмяМодуля = ЧастиИмени[0];
	
	Модуль = ИТКВ_БСПКлиентСерверПовтИсп.ОбщийМодуль(ИмяМодуля);
	Если Модуль = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Неизвестное имя модуля: %1 при вызове метода БСП", ИмяМодуля);
	КонецЕсли;
	ИмяФункции = ИТКВ_БСПКлиентСерверПовтИсп.ИмяФункцииМодуля(ЧастиИмени[1]);
	
	// Параметры
	ПараметрыФункции = Новый Массив;
	Для Индекс = 0 По Параметры.ВГраница() Цикл
		
		ПараметрыФункции.Добавить(СтрШаблон("Параметры[%1]", Индекс));
		
	КонецЦикла;
	
	Выражение = СтрШаблон("Модуль.%1(%2)", ИмяФункции, СтрСоединить(ПараметрыФункции, ","));
	Если Результат = Истина Тогда
		Результат = Вычислить(Выражение);
	Иначе
		Выполнить(Выражение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
