// BSLLS-off
&Вместо("ОтправитьСообщение")
Процедура Мок_ОтправитьСообщение(ОтправляемоеСообщение, Брокеры, Топик, НомерПартиции = -1, ИдентификаторСообщения = "", Заголовки = "", ТипСжатия = Неопределено, Эндпоинт = Неопределено)
	ПараметрыМетода = Мокито.МассивПараметров(ОтправляемоеСообщение, Брокеры, Топик, НомерПартиции,
		ИдентификаторСообщения, Заголовки, ТипСжатия, Эндпоинт);
	ПрерватьВыполнение = Ложь;

	МокитоПерехват.АнализВызова(инт_РаботаСКафка, "ОтправитьСообщение", ПараметрыМетода, ПрерватьВыполнение);

	Если Не ПрерватьВыполнение Тогда
		ПродолжитьВызов(ОтправляемоеСообщение, Брокеры, Топик, НомерПартиции,
			ИдентификаторСообщения, Заголовки, ТипСжатия, Эндпоинт);
	КонецЕсли;
КонецПроцедуры
