#Область ПрограммныйИнтерфейс

Функция ИспользуетсяБСП() Экспорт
	
	Возврат ИТК_БСППовтИсп.ИспользуетсяБСП();
	
КонецФункции

Функция Версия() Экспорт
	
	Возврат ИТК_БСППовтИсп.Версия();
	
КонецФункции

Процедура РазблокироватьРаботуСВнешнимиРесурсами() Экспорт
	
	ИТК_БСП.РазблокироватьРаботуСВнешнимиРесурсами();
	
КонецПроцедуры

Функция ПолноеИмяФормыСтандартнойОбработки(Идентификатор) Экспорт
	
	ОбъектМетаданных = Метаданные.Обработки.Найти(Идентификатор);
	
	Если ОбъектМетаданных <> Неопределено Тогда
		Возврат СтрШаблон("Обработка.%1.Форма", Идентификатор);
	КонецЕсли;
	
	АнглийскийИдентификатор = ИТК_БСПКлиентСерверПовтИсп.АнглийскийИдентификаторСтандартнойОбработки(Идентификатор);
	ОбъектМетаданных = Метаданные.Обработки.Найти(АнглийскийИдентификатор);
	
	Если ОбъектМетаданных = Неопределено Тогда
		Результат = Неопределено;
	Иначе
		Результат = СтрШаблон("Обработка.%1.Форма", АнглийскийИдентификатор);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция АнглийскаяБСП() Экспорт
	
	Возврат ИТК_БСП.АнглийскаяБСП();
	
КонецФункции

#КонецОбласти
