////////////////////////////////////////////////////////////////////////////////
// 
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Общий модуль обработки сообщений по типу подписчика
// Получает ОМ для обработки сообщений
// Параметры:
//  ТипПодписчика  - ПеречислениеСсылка.инт_ТипыПодписчиков - ссылка на тип подписчика.
// 
// Возвращаемое значение:
//  ОбщийМодуль - Модуль содержащий процедуры и функции для работы с сообщениями.
//
Функция ОбщийМодульОбработкиСообщенийПоТипуПодписчика(ТипПодписчика) Экспорт
    
    ВызватьИсключение "Устаревшая функция. Используйте инт_ПодписчикиОбщий для диспетчеризации.";
    
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
