////////////////////////////////////////////////////////////////////////////////
// 
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Общий модуль обработки сообщений по типу подписчика
// Получает ОМ для обработки сообщений
// Параметры:
//  ТипПодписчика  - ПеречислениеСсылка.инт_ТипыПодписчиков - ссылка на тип подписчика.
// 
// Возвращаемое значение:
//  ОбщийМодуль - Модуль содержащий процедуры и функции для работы с сообщениями.
//
Функция ОбщийМодульОбработкиСообщенийПоТипуПодписчика(ТипПодписчика) Экспорт
    
    ОбщийМодуль = Неопределено;
    
    Если ТипПодписчика = Перечисления.инт_ТипыПодписчиков.ПодсистемаИнтеграции Тогда
        ОбщийМодуль = инт_РаботаССообщениямиПодсистемаИнтеграции;
    ИначеЕсли ТипПодписчика = Перечисления.инт_ТипыПодписчиков.RabbitMQ Тогда
        ОбщийМодуль = инт_РаботаССообщениямиRabbitMQ;
    ИначеЕсли  ТипПодписчика = Перечисления.инт_ТипыПодписчиков.ПроизвольныйHTTP Тогда
        ОбщийМодуль = инт_РаботаССообщениямиПроизвольныйHTTP;
    ИначеЕсли  ТипПодписчика = Перечисления.инт_ТипыПодписчиков.JRPC2 Тогда
        ОбщийМодуль = инт_РаботаССообщениямиJRPC2;
	ИначеЕсли ТипПодписчика = Перечисления.инт_ТипыПодписчиков.Kafka Тогда
		ОбщийМодуль = инт_РаботаССообщениямиKafka;
    Иначе
        ВызватьИсключение СтрШаблон("Для переданного типа подписчика <%1> не удалось определить модуль обработки сообщений! Либо вы передали какую-то ересь, либо это страшный баг.", ТипПодписчика);
    КонецЕсли;
    Возврат ОбщийМодуль;
 		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
