////////////////////////////////////////////////////////////////////////////////

// инт_СтатусыИсходящихСообщенийПовтИсп

//  

////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Это ошибочный статус
//
// Параметры:
//  Статус     -  ПеречислениеСсылка.инт_СтатусыИсходящихСообщений, ПеречислениеСсылка.инт_СтатусыРассылкиИсходящихСообщений, ПеречислениеСсылка.инт_СтатусыВходящихСообщений -  Ссылка на проверяемый статус.
// 
// Возвращаемое значение:
//  Булево - Истина, если статус относится к ошибочным и Ложь, если нет. 
//
Функция ЭтоОшибочныйСтатус(СтатусСообщения) Экспорт
    Если ТипЗнч(СтатусСообщения) = тип("ПеречислениеСсылка.инт_СтатусыИсходящихСообщений") Тогда
    	Возврат Перечисления.инт_СтатусыИсходящихСообщений.ЭтоОшибочныйСтатус(СтатусСообщения);
    ИначеЕсли ТипЗнч(СтатусСообщения) = тип("ПеречислениеСсылка.инт_СтатусыРассылкиИсходящихСообщений") Тогда
        Возврат Перечисления.инт_СтатусыРассылкиИсходящихСообщений.ЭтоОшибочныйСтатус(СтатусСообщения);
    ИначеЕсли ТипЗнч(СтатусСообщения) = тип("ПеречислениеСсылка.инт_СтатусыВходящихСообщений") Тогда
        Возврат Перечисления.инт_СтатусыВходящихСообщений.ЭтоОшибочныйСтатус(СтатусСообщения);
    Иначе
        ВызватьИсключение "Не удалось определить тип статуса";
    КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
