///////////////////////////////////////////////////////////////////////////////
// инт_ФормированиеИсходящихСообщенийПовтИсп
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс
// Функция - Количество потоков формирования сообщений
// 
// Возвращаемое значение:
//  Число - количество одновременных потоков доступных в системе.(см. Константы.инт_КоличествоПотоковФормированияСообщений) 
//
Функция КоличествоПотоковФормированияСообщений() ЭКспорт
    Возврат Константы.инт_КоличествоПотоковФормированияСообщений.Получить();
КонецФункции

// Функция - Размер пачки формирования сообщений
// 
// Возвращаемое значение:
// Число  -  Количество сообщений обрабатываемое в одним потоком.
//
Функция РазмерПачкиФормированияСообщений() Экспорт
    Возврат Константы.инт_РазмерПачкиФормированияСообщений.Получить();
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
