#Область ПрограммныйИнтерфейс

Функция ЗапрешенныеКРедактированиюРеквизитыОбъекта(ИмяОбъекта) Экспорт
	
	Результат = Новый Массив;
	
	Если НЕ ИТК_БСППовтИсп.СуществуетПодсистема("СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов") Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Поддерживается("3.1") Тогда
		
		ПараметрыФункции = Новый Массив;
		ПараметрыФункции.Добавить(ИмяОбъекта);
		
		Результат = ИТК_БСПКлиентСервер.ВыполнитьФункцию("ЗапретРедактированияРеквизитовОбъектов.БлокируемыеРеквизитыОбъекта", ПараметрыФункции);
		
	Иначе
		
		Модуль = ИТК_БСПКлиентСерверПовтИсп.ОбщийМодуль("ЗапретРедактированияРеквизитовОбъектовСлужебный");
		Если Модуль.ЗапретРедактированияПредусмотрен(ИмяОбъекта) Тогда
			
			МенеджерОбъекта = ИТК_Метаданные.МенеджерОбъектаПоПолномуИмени(ИмяОбъекта);
			Результат = МенеджерОбъекта.ПолучитьБлокируемыеРеквизитыОбъекта();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуютсяДополнительныеРеквизиты(Ссылка) Экспорт
	
	Если НЕ ИТК_БСППовтИсп.СуществуетПодсистема("СтандартныеПодсистемы.Свойства") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить(Ссылка);
	
	Возврат ИТК_БСПКлиентСервер.ВыполнитьФункцию("УправлениеСвойствами.ИспользоватьДопРеквизиты", ПараметрыФункции);
	
КонецФункции

Функция ИспользуютсяДополнительныеСведения(Ссылка) Экспорт
	
	Если Не ИТК_БСППовтИсп.СуществуетПодсистема("СтандартныеПодсистемы.Свойства") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить(Ссылка);
	
	Возврат ИТК_БСПКлиентСервер.ВыполнитьФункцию("УправлениеСвойствами.ИспользоватьДопСведения", ПараметрыФункции);
	
КонецФункции

Функция СтруктураЗначенияСвойства() Экспорт
	
	Если АнглийскаяБСП() Тогда
		
		ПолеЗаголовок = "Title";
		ПолеТипЗначения = "ValueType";
		ПолеЭтоДополнительноеСведение = "IsAdditionalInfo";
		
		ПолеСвойство = "Property";
		ПолеЗначение = "Value";
		
	Иначе
		
		ПолеЗаголовок = "Заголовок";
		ПолеТипЗначения = "ТипЗначения";
		ПолеЭтоДополнительноеСведение = "ЭтоДополнительноеСведение";
		
		ПолеСвойство = "Свойство";
		ПолеЗначение = "Значение";
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ПолеСвойство", ПолеСвойство);
	Результат.Вставить("ПолеЗначение", ПолеЗначение);
	
	Результат.Вставить("ПолеЗаголовок", ПолеЗаголовок);
	Результат.Вставить("ПолеТипЗначения", ПолеТипЗначения);
	Результат.Вставить("ПолеЭтоДополнительноеСведение", ПолеЭтоДополнительноеСведение);
	
	СписокСвойств = Новый Массив;
	СписокСвойств.Добавить(ПолеЗаголовок);
	СписокСвойств.Добавить(ПолеТипЗначения);
	СписокСвойств.Добавить(ПолеЭтоДополнительноеСведение);
	Результат.Вставить("Список", СтрСоединить(СписокСвойств, ","));
	
	Возврат Результат;
	
КонецФункции

Функция РаботаСВнешнимиРесурсамиЗаблокирована() Экспорт
	
	Если НЕ ИТК_БСППовтИсп.СуществуетПодсистема("СтандартныеПодсистемы.РегламентныеЗадания") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Поддерживается("3.0") Тогда
		ИмяМодуля = "РегламентныеЗаданияСервер";
	Иначе
		ИмяМодуля = "РегламентныеЗаданияСлужебный";
	КонецЕсли;
	
	Возврат ИТК_БСПКлиентСервер.ВыполнитьФункцию(ИмяМодуля + ".РаботаСВнешнимиРесурсамиЗаблокирована");
	
КонецФункции

Процедура РазблокироватьРаботуСВнешнимиРесурсами() Экспорт
	
	Если НЕ ИТК_БСППовтИсп.СуществуетПодсистема("СтандартныеПодсистемы.РегламентныеЗадания") Тогда
		Возврат;
	КонецЕсли;
	
	Если Поддерживается("3.0") Тогда
		ИмяМодуля = "РегламентныеЗаданияСервер";
	Иначе
		ИмяМодуля = "РегламентныеЗаданияСлужебный";
	КонецЕсли;
	
	ИТК_БСПКлиентСервер.ВыполнитьПроцедуру(ИмяМодуля + ".РазрешитьРаботуСВнешнимиРесурсами");
	
КонецПроцедуры

Функция РегламентноеЗаданиеДоступноПоФункциональнымОпциям(Задание, ЗависимостиЗаданий = Неопределено) Экспорт
	
	Если НЕ ИТК_БСППовтИсп.СуществуетПодсистема("СтандартныеПодсистемы.РегламентныеЗадания") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить(Задание);
	ПараметрыФункции.Добавить(ЗависимостиЗаданий);
	
	Возврат ИТК_БСПКлиентСервер.ВыполнитьФункцию("РегламентныеЗаданияСлужебный.РегламентноеЗаданиеДоступноПоФункциональнымОпциям", ПараметрыФункции);
	
КонецФункции

Функция ДополнительнаяИнформацияПоРегламентномуЗаданию(ОбъектМетаданных) Экспорт
	
	ЗависимыеРегламентныеЗадания = ИТК_БСППовтИсп.РегламентныеЗаданияЗависимыеОтФункциональныхОпций();
	
	РаботаетСВнешнимиРесурсами = Ложь;
	ФункциональнаяОпция = "";
	ДоступноПоФункциональнымОпциям = Истина;
	ЗаданиеВМоделиСервиса = Ложь;
	
	ОписаниеРегламентногоЗадания = Неопределено;
	Если ЗависимыеРегламентныеЗадания <> Неопределено Тогда
		ОписаниеРегламентногоЗадания = ЗависимыеРегламентныеЗадания.Найти(ОбъектМетаданных, "РегламентноеЗадание");
	КонецЕсли;
	
	Если ОписаниеРегламентногоЗадания <> Неопределено Тогда
		
		ФункциональнаяОпция = ОписаниеРегламентногоЗадания.ФункциональнаяОпция;
		Если ТипЗнч(ФункциональнаяОпция) = Тип("ОбъектМетаданных") Тогда
			ФункциональнаяОпция = ФункциональнаяОпция.Имя;
		КонецЕсли;
		РаботаетСВнешнимиРесурсами = ОписаниеРегламентногоЗадания.РаботаетСВнешнимиРесурсами;
		
		ДоступноПоФункциональнымОпциям = РегламентноеЗаданиеДоступноПоФункциональнымОпциям(ОбъектМетаданных, ЗависимыеРегламентныеЗадания);
		
		РегламентныеЗаданияВМоделиСервиса = ИТК_БСППовтИсп.РегламентныеЗаданияВМоделиСервиса();
		ЗаданиеВМоделиСервиса = (РегламентныеЗаданияВМоделиСервиса.Получить(ОбъектМетаданных) <> Неопределено);
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("РаботаетСВнешнимиРесурсами", РаботаетСВнешнимиРесурсами);
	Результат.Вставить("ФункциональнаяОпция", ФункциональнаяОпция);
	Результат.Вставить("ДоступноПоФункциональнымОпциям", ДоступноПоФункциональнымОпциям);
	Результат.Вставить("ЗаданиеВМоделиСервиса", ЗаданиеВМоделиСервиса);
	
	Возврат Результат;
	
КонецФункции

Функция Поддерживается(Версия = Неопределено) Экспорт
	
	ВерсияБСП = ИТК_БСПВызовСервера.Версия();
	Если ВерсияБСП = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Версия = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат (ИТК_ОбщийКлиентСервер.СравнитьВерсии(ВерсияБСП, Версия) >= 0);
	
КонецФункции

Функция АнглийскаяБСП() Экспорт
	
	Возврат НЕ ИТК_Общий.ВариантВстроенногоЯзыкаРусский();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
